var ensembleData = {
  "time": "2026-09-15 21:32:32",
  "issue": "2026258",
  "code": "03,23,21,35,05,19,46",
  "zodiac": "龙,猴,狗,猴,虎,鼠,鸡",
  "wave": "blue,red,green,red,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026259",
  "ninePool": [
    "龙",
    "狗",
    "虎",
    "牛",
    "马",
    "猴",
    "兔",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "狗",
    "虎",
    "牛",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "蛇",
    "鸡"
  ],
  "numbers": [
    33,
    3,
    5,
    39,
    41,
    9,
    45,
    15,
    17,
    21,
    27,
    29,
    25,
    35,
    11,
    18
  ],
  "optTails": [
    2,
    4,
    6,
    1,
    5,
    8,
    9
  ],
  "pools": {
    "3": [
      "虎",
      "龙",
      "狗"
    ],
    "4": [
      "龙",
      "狗",
      "虎",
      "牛"
    ],
    "5": [
      "龙",
      "狗",
      "虎",
      "牛",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};