var ensembleData = {
  "time": "2026-08-18 21:32:32",
  "issue": "2026230",
  "code": "28,26,47,14,49,10,16",
  "zodiac": "兔,蛇,猴,蛇,马,鸡,兔",
  "wave": "green,blue,blue,blue,green,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026231",
  "ninePool": [
    "猪",
    "鸡",
    "蛇",
    "羊",
    "牛",
    "狗",
    "龙",
    "鼠",
    "马"
  ],
  "sixPool": [
    "猪",
    "鸡",
    "蛇",
    "羊",
    "牛",
    "狗"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "numbers": [
    32,
    2,
    34,
    38,
    8,
    10,
    44,
    14,
    46,
    20,
    22,
    26,
    12,
    42,
    18,
    24
  ],
  "optTails": [
    6,
    1,
    3,
    7,
    8,
    2,
    4
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猪"
    ],
    "4": [
      "猪",
      "鸡",
      "蛇",
      "羊"
    ],
    "5": [
      "猪",
      "鸡",
      "蛇",
      "羊",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};