var ensembleData = {
  "time": "2026-10-07 21:32:32",
  "issue": "2026280",
  "code": "01,26,28,29,03,05,15",
  "zodiac": "马,蛇,兔,虎,龙,虎,龙",
  "wave": "red,blue,green,red,blue,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026281",
  "ninePool": [
    "猴",
    "羊",
    "鼠",
    "猪",
    "马",
    "兔",
    "虎",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "猴",
    "羊",
    "鼠",
    "猪",
    "马",
    "兔"
  ],
  "killZodiacs": [
    "虎",
    "龙"
  ],
  "numbers": [
    32,
    35,
    36,
    8,
    11,
    12,
    44,
    47,
    48,
    20,
    23,
    24,
    13,
    28,
    31,
    4
  ],
  "optTails": [
    2,
    1,
    3,
    4,
    7,
    6,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "猪"
    ],
    "4": [
      "猴",
      "羊",
      "鼠",
      "猪"
    ],
    "5": [
      "猴",
      "羊",
      "鼠",
      "猪",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};