var ensembleData = {
  "time": "2026-08-24 21:32:32",
  "issue": "2026236",
  "code": "26,35,42,09,14,17,11",
  "zodiac": "蛇,猴,牛,狗,蛇,虎,猴",
  "wave": "blue,red,blue,blue,blue,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026237",
  "ninePool": [
    "羊",
    "狗",
    "马",
    "蛇",
    "鸡",
    "猪",
    "鼠",
    "牛",
    "猴"
  ],
  "sixPool": [
    "羊",
    "狗",
    "蛇",
    "马",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "numbers": [
    33,
    2,
    36,
    38,
    9,
    12,
    45,
    14,
    48,
    21,
    24,
    26,
    34,
    44,
    25,
    8
  ],
  "optTails": [
    2,
    6,
    1,
    8,
    9,
    4,
    5
  ],
  "pools": {
    "3": [
      "羊",
      "狗",
      "蛇"
    ],
    "4": [
      "羊",
      "狗",
      "蛇",
      "马"
    ],
    "5": [
      "羊",
      "狗",
      "蛇",
      "马",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};