var ensembleData = {
  "time": "2026-10-09 21:32:32",
  "issue": "2026282",
  "code": "44,03,37,46,29,20,23",
  "zodiac": "猪,龙,马,鸡,虎,猪,猴",
  "wave": "green,blue,blue,red,red,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026283",
  "ninePool": [
    "狗",
    "兔",
    "羊",
    "猪",
    "鸡",
    "猴",
    "龙",
    "虎",
    "牛"
  ],
  "sixPool": [
    "狗",
    "兔",
    "猪",
    "羊",
    "鸡",
    "猴"
  ],
  "killZodiacs": [
    "牛",
    "猴"
  ],
  "numbers": [
    33,
    3,
    4,
    39,
    40,
    9,
    45,
    15,
    16,
    21,
    27,
    28,
    34,
    36,
    32,
    12,
    3,
    39,
    15,
    27
  ],
  "optTails": [
    0,
    3,
    5,
    1,
    2,
    4,
    6
  ],
  "pools": {
    "3": [
      "兔",
      "狗",
      "龙"
    ],
    "4": [
      "狗",
      "兔",
      "猪",
      "羊"
    ],
    "5": [
      "狗",
      "兔",
      "猪",
      "羊",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};