var ensembleData = {
  "time": "2026-08-26 21:32:32",
  "issue": "2026238",
  "code": "35,44,23,04,07,21,17",
  "zodiac": "猴,猪,猴,兔,鼠,狗,虎",
  "wave": "red,green,red,blue,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026239",
  "ninePool": [
    "马",
    "龙",
    "羊",
    "狗",
    "蛇",
    "鼠",
    "兔",
    "猴",
    "虎"
  ],
  "sixPool": [
    "马",
    "龙",
    "羊",
    "狗",
    "蛇",
    "鼠"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "numbers": [
    1,
    3,
    36,
    37,
    39,
    12,
    13,
    15,
    48,
    24,
    25,
    27,
    33,
    45,
    21,
    31
  ],
  "optTails": [
    7,
    1,
    6,
    8,
    3,
    4,
    5
  ],
  "pools": {
    "3": [
      "龙",
      "马",
      "羊"
    ],
    "4": [
      "马",
      "龙",
      "羊",
      "狗"
    ],
    "5": [
      "马",
      "龙",
      "羊",
      "狗",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};