var ensembleData = {
  "time": "2026-09-18 21:32:32",
  "issue": "2026261",
  "code": "06,25,43,46,29,47,24",
  "zodiac": "牛,马,鼠,鸡,虎,猴,羊",
  "wave": "green,blue,green,red,red,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026262",
  "ninePool": [
    "猴",
    "兔",
    "鸡",
    "鼠",
    "猪",
    "羊",
    "狗",
    "虎",
    "牛"
  ],
  "sixPool": [
    "猴",
    "兔",
    "鸡",
    "鼠",
    "羊",
    "猪"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "numbers": [
    34,
    35,
    4,
    40,
    10,
    11,
    46,
    47,
    16,
    22,
    23,
    28,
    31,
    8,
    43,
    48
  ],
  "optTails": [
    2,
    4,
    0,
    1,
    7,
    3,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "鸡"
    ],
    "4": [
      "猴",
      "兔",
      "鸡",
      "鼠"
    ],
    "5": [
      "猴",
      "兔",
      "鸡",
      "鼠",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};