var ensembleData = {
  "time": "2026-09-24 21:32:32",
  "issue": "2026267",
  "code": "16,20,25,22,09,41,40",
  "zodiac": "兔,猪,马,鸡,狗,虎,兔",
  "wave": "green,blue,blue,green,blue,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026268",
  "ninePool": [
    "蛇",
    "猴",
    "猪",
    "牛",
    "狗",
    "龙",
    "马",
    "鼠",
    "鸡"
  ],
  "sixPool": [
    "蛇",
    "猴",
    "猪",
    "牛",
    "狗",
    "龙"
  ],
  "killZodiacs": [
    "猴",
    "兔"
  ],
  "numbers": [
    32,
    2,
    35,
    38,
    8,
    11,
    44,
    14,
    47,
    20,
    23,
    26,
    33,
    45,
    15,
    3
  ],
  "optTails": [
    1,
    4,
    6,
    8,
    3,
    5,
    7
  ],
  "pools": {
    "3": [
      "猴",
      "蛇",
      "猪"
    ],
    "4": [
      "蛇",
      "猴",
      "猪",
      "牛"
    ],
    "5": [
      "蛇",
      "猴",
      "猪",
      "牛",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};