var ensembleData = {
  "time": "2026-06-30 21:32:32",
  "issue": "2026181",
  "code": "17,29,06,34,47,15,19",
  "zodiac": "虎,虎,牛,鸡,猴,龙,鼠",
  "wave": "green,red,green,red,blue,blue,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026182",
  "ninePool": [
    "虎",
    "兔",
    "牛",
    "龙",
    "鸡",
    "猴",
    "羊",
    "蛇",
    "马"
  ],
  "sixPool": [
    "虎",
    "兔",
    "牛",
    "龙",
    "鸡",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    4,
    5,
    6,
    40,
    41,
    42,
    16,
    17,
    18,
    28,
    29,
    30,
    48,
    27,
    39,
    15
  ],
  "optTails": [
    1,
    4,
    6,
    5,
    8,
    9,
    7
  ],
  "pools": {
    "3": [
      "虎",
      "牛",
      "兔"
    ],
    "4": [
      "虎",
      "兔",
      "牛",
      "龙"
    ],
    "5": [
      "虎",
      "兔",
      "牛",
      "龙",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};