var ensembleData = {
  "time": "2026-10-08 21:32:32",
  "issue": "2026281",
  "code": "22,19,21,32,48,38,10",
  "zodiac": "鸡,鼠,狗,猪,羊,蛇,鸡",
  "wave": "green,red,green,green,blue,green,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026282",
  "ninePool": [
    "虎",
    "龙",
    "羊",
    "牛",
    "猪",
    "猴",
    "兔",
    "鸡",
    "狗"
  ],
  "sixPool": [
    "龙",
    "虎",
    "羊",
    "牛",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "numbers": [
    3,
    36,
    5,
    39,
    41,
    12,
    15,
    48,
    17,
    24,
    27,
    29,
    47,
    6,
    23,
    44
  ],
  "optTails": [
    0,
    1,
    3,
    4,
    7,
    6,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "羊"
    ],
    "4": [
      "龙",
      "虎",
      "羊",
      "牛"
    ],
    "5": [
      "龙",
      "虎",
      "羊",
      "牛",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};