var ensembleData = {
  "time": "2026-09-26 21:32:32",
  "issue": "2026269",
  "code": "19,40,36,05,38,16,22",
  "zodiac": "鼠,兔,羊,虎,蛇,兔,鸡",
  "wave": "red,red,blue,green,green,green,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026270",
  "ninePool": [
    "狗",
    "马",
    "牛",
    "猴",
    "猪",
    "鸡",
    "羊",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "马",
    "牛",
    "鸡",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "鼠",
    "鸡"
  ],
  "numbers": [
    1,
    33,
    37,
    6,
    9,
    42,
    45,
    13,
    18,
    21,
    25,
    30,
    34,
    32,
    11,
    23
  ],
  "optTails": [
    0,
    1,
    2,
    4,
    8,
    3,
    6
  ],
  "pools": {
    "3": [
      "狗",
      "马",
      "牛"
    ],
    "4": [
      "狗",
      "马",
      "牛",
      "鸡"
    ],
    "5": [
      "狗",
      "马",
      "牛",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};