var ensembleData = {
  "time": "2026-08-07 21:32:32",
  "issue": "2026219",
  "code": "31,41,07,08,29,22,43",
  "zodiac": "鼠,虎,鼠,猪,虎,鸡,鼠",
  "wave": "blue,blue,red,red,red,green,green",
  "teSx": "鼠",
  "teWei": 3,
  "nextIssue": "2026220",
  "ninePool": [
    "鸡",
    "龙",
    "羊",
    "牛",
    "狗",
    "马",
    "猴",
    "虎",
    "兔"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "牛",
    "羊",
    "马",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    34,
    3,
    6,
    39,
    10,
    42,
    46,
    15,
    18,
    22,
    27,
    30,
    48,
    45,
    21,
    9
  ],
  "optTails": [
    4,
    6,
    7,
    1,
    5,
    9,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "鸡",
      "牛"
    ],
    "4": [
      "龙",
      "鸡",
      "牛",
      "羊"
    ],
    "5": [
      "龙",
      "鸡",
      "牛",
      "羊",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};