var ensembleData = {
  "time": "2026-07-04 21:32:32",
  "issue": "2026185",
  "code": "18,35,09,41,12,30,36",
  "zodiac": "牛,猴,狗,虎,羊,牛,羊",
  "wave": "red,red,blue,blue,red,red,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026186",
  "ninePool": [
    "猴",
    "猪",
    "兔",
    "鼠",
    "鸡",
    "虎",
    "牛",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "猴",
    "猪",
    "兔",
    "鼠",
    "鸡",
    "虎"
  ],
  "killZodiacs": [
    "蛇",
    "羊"
  ],
  "numbers": [
    34,
    35,
    7,
    10,
    11,
    43,
    46,
    47,
    19,
    22,
    23,
    31,
    5,
    16,
    8,
    32
  ],
  "optTails": [
    1,
    4,
    5,
    6,
    8,
    9,
    2
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "鼠"
    ],
    "4": [
      "猴",
      "猪",
      "兔",
      "鼠"
    ],
    "5": [
      "猴",
      "猪",
      "兔",
      "鼠",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};