var ensembleData = {
  "time": "2026-07-09 21:32:32",
  "issue": "2026190",
  "code": "46,14,19,37,48,29,16",
  "zodiac": "鸡,蛇,鼠,马,羊,虎,兔",
  "wave": "red,blue,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026191",
  "ninePool": [
    "猪",
    "狗",
    "牛",
    "鼠",
    "蛇",
    "鸡",
    "龙",
    "马",
    "兔"
  ],
  "sixPool": [
    "猪",
    "狗",
    "牛",
    "鼠",
    "蛇",
    "鸡"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "numbers": [
    33,
    6,
    7,
    9,
    42,
    43,
    45,
    18,
    19,
    21,
    30,
    31,
    38,
    34,
    22,
    2
  ],
  "optTails": [
    1,
    6,
    3,
    4,
    2,
    7,
    8
  ],
  "pools": {
    "3": [
      "牛",
      "狗",
      "鼠"
    ],
    "4": [
      "猪",
      "狗",
      "牛",
      "鼠"
    ],
    "5": [
      "猪",
      "狗",
      "牛",
      "鼠",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};