var ensembleData = {
  "time": "2026-07-23 21:32:32",
  "issue": "2026204",
  "code": "11,12,17,26,10,07,05",
  "zodiac": "猴,羊,虎,蛇,鸡,鼠,虎",
  "wave": "green,red,green,blue,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026205",
  "ninePool": [
    "龙",
    "狗",
    "兔",
    "蛇",
    "鸡",
    "虎",
    "马",
    "猴",
    "猪"
  ],
  "sixPool": [
    "龙",
    "狗",
    "兔",
    "蛇",
    "虎",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "虎"
  ],
  "numbers": [
    33,
    3,
    4,
    39,
    40,
    9,
    45,
    15,
    16,
    21,
    27,
    28,
    34,
    17,
    22,
    46
  ],
  "optTails": [
    2,
    6,
    7,
    8,
    1,
    3,
    4
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "兔"
    ],
    "4": [
      "龙",
      "狗",
      "兔",
      "蛇"
    ],
    "5": [
      "龙",
      "狗",
      "兔",
      "蛇",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};