var ensembleData = {
  "time": "2026-10-10 21:32:32",
  "issue": "2026283",
  "code": "35,08,15,06,21,01,18",
  "zodiac": "猴,猪,龙,牛,狗,马,牛",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026284",
  "ninePool": [
    "猪",
    "马",
    "鼠",
    "兔",
    "虎",
    "羊",
    "蛇",
    "龙",
    "牛"
  ],
  "sixPool": [
    "猪",
    "马",
    "鼠",
    "兔",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "猴",
    "牛"
  ],
  "numbers": [
    32,
    1,
    4,
    37,
    8,
    40,
    44,
    13,
    16,
    20,
    25,
    28,
    41,
    36,
    31,
    7
  ],
  "optTails": [
    3,
    1,
    4,
    5,
    7,
    8,
    6
  ],
  "pools": {
    "3": [
      "马",
      "猪",
      "兔"
    ],
    "4": [
      "猪",
      "马",
      "鼠",
      "兔"
    ],
    "5": [
      "猪",
      "马",
      "鼠",
      "兔",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};