var ensembleData = {
  "time": "2026-08-15 21:32:32",
  "issue": "2026227",
  "code": "23,24,29,07,13,31,16",
  "zodiac": "猴,羊,虎,鼠,马,鼠,兔",
  "wave": "red,red,red,red,red,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026228",
  "ninePool": [
    "牛",
    "羊",
    "鸡",
    "鼠",
    "猪",
    "马",
    "龙",
    "狗",
    "虎"
  ],
  "sixPool": [
    "牛",
    "羊",
    "鸡",
    "鼠",
    "猪",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "兔"
  ],
  "numbers": [
    34,
    6,
    7,
    10,
    42,
    43,
    46,
    18,
    19,
    22,
    30,
    31,
    12,
    44,
    24,
    32
  ],
  "optTails": [
    1,
    3,
    6,
    7,
    8,
    2,
    4
  ],
  "pools": {
    "3": [
      "牛",
      "鸡",
      "鼠"
    ],
    "4": [
      "牛",
      "羊",
      "鸡",
      "鼠"
    ],
    "5": [
      "牛",
      "羊",
      "鸡",
      "鼠",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};