var ensembleData = {
  "time": "2026-07-26 21:32:32",
  "issue": "2026207",
  "code": "09,40,26,23,44,13,31",
  "zodiac": "狗,兔,蛇,猴,猪,马,鼠",
  "wave": "blue,red,blue,red,green,red,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026208",
  "ninePool": [
    "鸡",
    "蛇",
    "龙",
    "牛",
    "羊",
    "马",
    "兔",
    "狗",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "龙",
    "牛",
    "羊",
    "马"
  ],
  "killZodiacs": [
    "鼠",
    "鼠"
  ],
  "numbers": [
    34,
    3,
    2,
    38,
    39,
    10,
    46,
    15,
    14,
    22,
    26,
    27,
    12,
    30,
    42,
    13
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    6,
    4,
    8
  ],
  "pools": {
    "3": [
      "鸡",
      "龙",
      "蛇"
    ],
    "4": [
      "鸡",
      "蛇",
      "龙",
      "牛"
    ],
    "5": [
      "鸡",
      "蛇",
      "龙",
      "牛",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};