var ensembleData = {
  "time": "2026-10-24 21:32:32",
  "issue": "2026297",
  "code": "27,40,25,26,33,09,13",
  "zodiac": "龙,兔,马,蛇,狗,狗,马",
  "wave": "green,red,blue,blue,green,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026298",
  "ninePool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "猪",
    "虎",
    "兔",
    "鸡",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "虎",
    "猪"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "numbers": [
    33,
    34,
    3,
    39,
    9,
    10,
    45,
    46,
    15,
    21,
    22,
    27,
    41,
    31,
    6,
    42,
    34,
    10,
    46,
    22
  ],
  "optTails": [
    3,
    8,
    0,
    6,
    1,
    2,
    4
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "鸡"
    ],
    "4": [
      "狗",
      "龙",
      "牛",
      "鼠"
    ],
    "5": [
      "狗",
      "龙",
      "牛",
      "鼠",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};