var ensembleData = {
  "time": "2026-09-13 21:32:32",
  "issue": "2026256",
  "code": "40,15,09,37,07,03,01",
  "zodiac": "兔,龙,狗,马,鼠,龙,马",
  "wave": "red,blue,blue,blue,red,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026257",
  "ninePool": [
    "龙",
    "蛇",
    "兔",
    "牛",
    "鼠",
    "虎",
    "猴",
    "羊",
    "狗"
  ],
  "sixPool": [
    "龙",
    "蛇",
    "兔",
    "牛",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "牛",
    "马"
  ],
  "numbers": [
    2,
    3,
    38,
    39,
    6,
    42,
    14,
    15,
    18,
    26,
    27,
    30,
    31,
    35,
    43,
    11
  ],
  "optTails": [
    0,
    2,
    4,
    1,
    3,
    6,
    5
  ],
  "pools": {
    "3": [
      "龙",
      "蛇",
      "牛"
    ],
    "4": [
      "龙",
      "蛇",
      "兔",
      "牛"
    ],
    "5": [
      "龙",
      "蛇",
      "兔",
      "牛",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};