var ensembleData = {
  "time": "2026-10-20 21:32:32",
  "issue": "2026293",
  "code": "38,10,48,49,13,09,05",
  "zodiac": "蛇,鸡,羊,马,马,狗,虎",
  "wave": "green,blue,blue,green,red,blue,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026294",
  "ninePool": [
    "狗",
    "羊",
    "猴",
    "鸡",
    "龙",
    "鼠",
    "猪",
    "马",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "羊",
    "猴",
    "鸡",
    "龙",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "numbers": [
    33,
    35,
    36,
    9,
    11,
    12,
    45,
    47,
    48,
    21,
    23,
    24,
    34,
    3,
    43,
    46
  ],
  "optTails": [
    8,
    0,
    2,
    4,
    6,
    9,
    3
  ],
  "pools": {
    "3": [
      "狗",
      "羊",
      "猴"
    ],
    "4": [
      "狗",
      "羊",
      "猴",
      "鸡"
    ],
    "5": [
      "狗",
      "羊",
      "猴",
      "鸡",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};