var ensembleData = {
  "time": "2026-08-27 21:32:32",
  "issue": "2026239",
  "code": "47,43,34,17,22,07,05",
  "zodiac": "猴,鼠,鸡,虎,鸡,鼠,虎",
  "wave": "blue,green,red,green,green,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026240",
  "ninePool": [
    "兔",
    "狗",
    "鼠",
    "蛇",
    "鸡",
    "虎",
    "龙",
    "牛",
    "马"
  ],
  "sixPool": [
    "兔",
    "狗",
    "鼠",
    "蛇",
    "鸡",
    "虎"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "numbers": [
    33,
    4,
    7,
    40,
    9,
    43,
    45,
    16,
    19,
    21,
    28,
    31,
    34,
    46,
    10,
    41
  ],
  "optTails": [
    7,
    0,
    1,
    6,
    9,
    3,
    4
  ],
  "pools": {
    "3": [
      "兔",
      "狗",
      "鼠"
    ],
    "4": [
      "兔",
      "狗",
      "鼠",
      "蛇"
    ],
    "5": [
      "兔",
      "狗",
      "鼠",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};