var ensembleData = {
  "time": "2026-07-17 21:32:32",
  "issue": "2026198",
  "code": "48,35,45,21,12,24,07",
  "zodiac": "羊,猴,狗,狗,羊,羊,鼠",
  "wave": "blue,red,red,green,red,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026199",
  "ninePool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "蛇",
    "虎",
    "兔",
    "狗",
    "马"
  ],
  "sixPool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "蛇",
    "虎"
  ],
  "killZodiacs": [
    "蛇",
    "鼠"
  ],
  "numbers": [
    34,
    2,
    36,
    38,
    10,
    12,
    46,
    14,
    48,
    22,
    24,
    26,
    11,
    42,
    18,
    41
  ],
  "optTails": [
    5,
    9,
    6,
    8,
    1,
    2,
    4
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "蛇"
    ],
    "4": [
      "羊",
      "鸡",
      "猴",
      "牛"
    ],
    "5": [
      "羊",
      "鸡",
      "猴",
      "牛",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};