var ensembleData = {
  "time": "2026-10-03 21:32:32",
  "issue": "2026276",
  "code": "02,21,17,40,11,24,14",
  "zodiac": "蛇,狗,虎,兔,猴,羊,蛇",
  "wave": "red,green,green,red,green,red,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026277",
  "ninePool": [
    "牛",
    "鼠",
    "猴",
    "虎",
    "猪",
    "鸡",
    "兔",
    "龙",
    "狗"
  ],
  "sixPool": [
    "牛",
    "鼠",
    "猴",
    "虎",
    "猪",
    "鸡"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    35,
    6,
    7,
    42,
    43,
    11,
    47,
    18,
    19,
    23,
    30,
    31,
    41,
    46,
    17,
    10
  ],
  "optTails": [
    0,
    2,
    5,
    3,
    7,
    1,
    6
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "猴"
    ],
    "4": [
      "牛",
      "鼠",
      "猴",
      "虎"
    ],
    "5": [
      "牛",
      "鼠",
      "猴",
      "虎",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};