var ensembleData = {
  "time": "2026-09-14 21:32:32",
  "issue": "2026257",
  "code": "08,46,47,39,27,45,07",
  "zodiac": "猪,鸡,猴,龙,龙,狗,鼠",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026258",
  "ninePool": [
    "狗",
    "蛇",
    "马",
    "龙",
    "牛",
    "兔",
    "鸡",
    "猪",
    "鼠"
  ],
  "sixPool": [
    "狗",
    "蛇",
    "马",
    "牛",
    "兔",
    "龙"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "numbers": [
    33,
    2,
    1,
    37,
    38,
    9,
    45,
    14,
    13,
    21,
    25,
    26,
    28,
    3,
    6,
    39
  ],
  "optTails": [
    0,
    2,
    4,
    3,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "蛇",
      "马"
    ],
    "4": [
      "狗",
      "蛇",
      "马",
      "牛"
    ],
    "5": [
      "狗",
      "蛇",
      "马",
      "牛",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};