var ensembleData = {
  "time": "2026-07-16 21:32:32",
  "issue": "2026197",
  "code": "40,19,30,48,44,28,08",
  "zodiac": "兔,鼠,牛,羊,猪,兔,猪",
  "wave": "red,red,red,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026198",
  "ninePool": [
    "牛",
    "兔",
    "龙",
    "羊",
    "猴",
    "虎",
    "蛇",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "牛",
    "兔",
    "龙",
    "羊",
    "猴",
    "虎"
  ],
  "killZodiacs": [
    "鸡",
    "猪"
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    47,
    17,
    11,
    41
  ],
  "optTails": [
    6,
    9,
    0,
    1,
    3,
    4,
    7
  ],
  "pools": {
    "3": [
      "牛",
      "兔",
      "龙"
    ],
    "4": [
      "牛",
      "兔",
      "龙",
      "羊"
    ],
    "5": [
      "牛",
      "兔",
      "龙",
      "羊",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};