var ensembleData = {
  "time": "2026-10-18 21:32:32",
  "issue": "2026291",
  "code": "32,10,41,38,22,02,17",
  "zodiac": "猪,鸡,虎,蛇,鸡,蛇,虎",
  "wave": "green,blue,blue,green,green,red,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026292",
  "ninePool": [
    "狗",
    "马",
    "兔",
    "猴",
    "鸡",
    "蛇",
    "龙",
    "猪",
    "鼠"
  ],
  "sixPool": [
    "狗",
    "马",
    "兔",
    "猴",
    "鸡",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "numbers": [
    33,
    1,
    4,
    37,
    40,
    9,
    45,
    13,
    16,
    21,
    25,
    28,
    34,
    26,
    46,
    22
  ],
  "optTails": [
    8,
    0,
    2,
    3,
    4,
    9,
    6
  ],
  "pools": {
    "3": [
      "狗",
      "兔",
      "马"
    ],
    "4": [
      "狗",
      "马",
      "兔",
      "猴"
    ],
    "5": [
      "狗",
      "马",
      "兔",
      "猴",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};