var ensembleData = {
  "time": "2026-08-16 21:32:32",
  "issue": "2026228",
  "code": "38,26,08,06,29,18,23",
  "zodiac": "蛇,蛇,猪,牛,虎,牛,猴",
  "wave": "green,blue,red,green,red,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026229",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "龙",
    "猪",
    "狗",
    "马",
    "虎",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "牛",
    "狗",
    "猪",
    "龙"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "numbers": [
    2,
    34,
    38,
    6,
    10,
    42,
    14,
    46,
    18,
    22,
    26,
    30,
    27,
    44,
    32,
    8
  ],
  "optTails": [
    3,
    1,
    6,
    7,
    8,
    2,
    4
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "牛"
    ],
    "4": [
      "鸡",
      "蛇",
      "牛",
      "狗"
    ],
    "5": [
      "鸡",
      "蛇",
      "牛",
      "狗",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};