var ensembleData = {
  "time": "2026-08-31 21:32:32",
  "issue": "2026243",
  "code": "42,17,12,46,09,24,21",
  "zodiac": "牛,虎,羊,鸡,狗,羊,狗",
  "wave": "blue,green,red,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026244",
  "ninePool": [
    "鼠",
    "马",
    "兔",
    "虎",
    "龙",
    "羊",
    "鸡",
    "蛇",
    "猴"
  ],
  "sixPool": [
    "鼠",
    "马",
    "虎",
    "兔",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "狗"
  ],
  "numbers": [
    1,
    36,
    37,
    7,
    43,
    12,
    13,
    48,
    19,
    24,
    25,
    31,
    28,
    41,
    15,
    4
  ],
  "optTails": [
    9,
    1,
    7,
    5,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "鼠",
      "马",
      "羊"
    ],
    "4": [
      "鼠",
      "马",
      "虎",
      "兔"
    ],
    "5": [
      "鼠",
      "马",
      "虎",
      "兔",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};