var ensembleData = {
  "time": "2026-08-19 21:32:32",
  "issue": "2026231",
  "code": "39,46,23,11,08,13,20",
  "zodiac": "龙,鸡,猴,猴,猪,马,猪",
  "wave": "green,red,red,green,red,red,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026232",
  "ninePool": [
    "马",
    "牛",
    "猴",
    "羊",
    "龙",
    "鼠",
    "蛇",
    "鸡",
    "虎"
  ],
  "sixPool": [
    "马",
    "牛",
    "猴",
    "羊",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    1,
    35,
    37,
    6,
    42,
    11,
    13,
    47,
    18,
    23,
    25,
    30,
    12,
    2,
    24,
    14
  ],
  "optTails": [
    6,
    3,
    0,
    8,
    9,
    2,
    4
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "猴"
    ],
    "4": [
      "马",
      "牛",
      "猴",
      "羊"
    ],
    "5": [
      "马",
      "牛",
      "猴",
      "羊",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};