var ensembleData = {
  "time": "2026-09-10 21:32:32",
  "issue": "2026253",
  "code": "05,35,15,28,13,49,16",
  "zodiac": "虎,猴,龙,兔,马,马,兔",
  "wave": "green,red,blue,green,red,green,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026254",
  "ninePool": [
    "羊",
    "鼠",
    "马",
    "牛",
    "鸡",
    "虎",
    "兔",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "鼠",
    "马",
    "牛",
    "鸡",
    "兔"
  ],
  "killZodiacs": [
    "蛇",
    "兔"
  ],
  "numbers": [
    1,
    36,
    37,
    7,
    43,
    12,
    13,
    48,
    19,
    24,
    25,
    31,
    34,
    4,
    42,
    22
  ],
  "optTails": [
    6,
    2,
    4,
    8,
    1,
    5,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "羊",
      "马"
    ],
    "4": [
      "羊",
      "鼠",
      "马",
      "牛"
    ],
    "5": [
      "羊",
      "鼠",
      "马",
      "牛",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};