var ensembleData = {
  "time": "2026-09-17 21:32:32",
  "issue": "2026260",
  "code": "25,26,44,32,06,48,20",
  "zodiac": "马,蛇,猪,猪,牛,羊,猪",
  "wave": "blue,blue,green,green,green,blue,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026261",
  "ninePool": [
    "猴",
    "虎",
    "鸡",
    "狗",
    "羊",
    "牛",
    "蛇",
    "兔",
    "猪"
  ],
  "sixPool": [
    "猴",
    "虎",
    "鸡",
    "狗",
    "羊",
    "蛇"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    34,
    35,
    5,
    41,
    10,
    11,
    46,
    47,
    17,
    22,
    23,
    29,
    33,
    24,
    48,
    38
  ],
  "optTails": [
    2,
    6,
    1,
    4,
    7,
    3,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "鸡",
      "猴"
    ],
    "4": [
      "猴",
      "虎",
      "鸡",
      "狗"
    ],
    "5": [
      "猴",
      "虎",
      "鸡",
      "狗",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};