var ensembleData = {
  "time": "2026-09-28 21:32:32",
  "issue": "2026271",
  "code": "25,02,05,22,20,31,35",
  "zodiac": "马,蛇,虎,鸡,猪,鼠,猴",
  "wave": "blue,red,green,green,blue,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026272",
  "ninePool": [
    "羊",
    "牛",
    "马",
    "龙",
    "蛇",
    "狗",
    "虎",
    "猪",
    "鼠"
  ],
  "sixPool": [
    "羊",
    "牛",
    "马",
    "龙",
    "蛇",
    "狗"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "numbers": [
    1,
    36,
    37,
    6,
    42,
    12,
    13,
    48,
    18,
    24,
    25,
    30,
    33,
    3,
    26,
    27
  ],
  "optTails": [
    1,
    2,
    8,
    3,
    4,
    6,
    7
  ],
  "pools": {
    "3": [
      "羊",
      "牛",
      "马"
    ],
    "4": [
      "羊",
      "牛",
      "马",
      "龙"
    ],
    "5": [
      "羊",
      "牛",
      "马",
      "龙",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};