var ensembleData = {
  "time": "2026-10-17 21:32:32",
  "issue": "2026290",
  "code": "08,09,17,15,07,02,40",
  "zodiac": "猪,狗,虎,龙,鼠,蛇,兔",
  "wave": "red,blue,green,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026291",
  "ninePool": [
    "狗",
    "羊",
    "牛",
    "龙",
    "蛇",
    "鼠",
    "兔",
    "虎",
    "猴"
  ],
  "sixPool": [
    "狗",
    "羊",
    "牛",
    "龙",
    "蛇",
    "兔"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "numbers": [
    33,
    36,
    4,
    40,
    9,
    12,
    45,
    48,
    16,
    21,
    24,
    28,
    3,
    6,
    26,
    42
  ],
  "optTails": [
    0,
    2,
    3,
    5,
    1,
    6,
    7
  ],
  "pools": {
    "3": [
      "狗",
      "羊",
      "兔"
    ],
    "4": [
      "狗",
      "羊",
      "牛",
      "龙"
    ],
    "5": [
      "狗",
      "羊",
      "牛",
      "龙",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};