var ensembleData = {
  "time": "2026-09-29 21:32:32",
  "issue": "2026272",
  "code": "43,15,04,06,32,36,02",
  "zodiac": "鼠,龙,兔,牛,猪,羊,蛇",
  "wave": "green,blue,blue,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026273",
  "ninePool": [
    "虎",
    "牛",
    "羊",
    "马",
    "兔",
    "鼠",
    "猴",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "虎",
    "羊",
    "马",
    "兔",
    "猴"
  ],
  "killZodiacs": [
    "牛",
    "蛇"
  ],
  "numbers": [
    36,
    5,
    6,
    41,
    42,
    12,
    48,
    17,
    18,
    24,
    29,
    30,
    13,
    25,
    4,
    11
  ],
  "optTails": [
    0,
    2,
    1,
    5,
    3,
    4,
    6
  ],
  "pools": {
    "3": [
      "牛",
      "虎",
      "羊"
    ],
    "4": [
      "牛",
      "虎",
      "羊",
      "马"
    ],
    "5": [
      "牛",
      "虎",
      "羊",
      "马",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};