var ensembleData = {
  "time": "2026-07-18 21:32:32",
  "issue": "2026199",
  "code": "17,49,42,45,05,38,36",
  "zodiac": "虎,马,牛,狗,虎,蛇,羊",
  "wave": "green,green,blue,red,green,green,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026200",
  "ninePool": [
    "鸡",
    "猴",
    "兔",
    "龙",
    "狗",
    "猪",
    "鼠",
    "牛",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "龙",
    "兔",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    34,
    35,
    3,
    39,
    10,
    11,
    46,
    47,
    15,
    22,
    23,
    27,
    20,
    4,
    43,
    31
  ],
  "optTails": [
    7,
    8,
    0,
    1,
    2,
    3,
    4
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "龙"
    ],
    "4": [
      "鸡",
      "猴",
      "龙",
      "兔"
    ],
    "5": [
      "鸡",
      "猴",
      "龙",
      "兔",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};