var ensembleData = {
  "time": "2026-08-11 21:32:32",
  "issue": "2026223",
  "code": "21,43,01,38,29,44,23",
  "zodiac": "狗,鼠,马,蛇,虎,猪,猴",
  "wave": "green,green,red,green,red,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026224",
  "ninePool": [
    "龙",
    "兔",
    "蛇",
    "羊",
    "鸡",
    "牛",
    "猪",
    "虎",
    "狗"
  ],
  "sixPool": [
    "龙",
    "兔",
    "蛇",
    "羊",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    2,
    3,
    4,
    38,
    39,
    40,
    14,
    15,
    16,
    26,
    27,
    28,
    30,
    10,
    34,
    46
  ],
  "optTails": [
    3,
    4,
    6,
    7,
    1,
    0,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "蛇",
      "龙"
    ],
    "4": [
      "龙",
      "兔",
      "蛇",
      "羊"
    ],
    "5": [
      "龙",
      "兔",
      "蛇",
      "羊",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};