var ensembleData = {
  "time": "2026-09-01 21:32:32",
  "issue": "2026244",
  "code": "09,14,03,17,33,40,46",
  "zodiac": "狗,蛇,龙,虎,狗,兔,鸡",
  "wave": "blue,blue,blue,green,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026245",
  "ninePool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "猴",
    "狗",
    "鼠",
    "猪",
    "牛"
  ],
  "sixPool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "虎",
    "鸡"
  ],
  "numbers": [
    1,
    3,
    4,
    37,
    39,
    40,
    13,
    15,
    16,
    25,
    27,
    28,
    33,
    14,
    26,
    23
  ],
  "optTails": [
    1,
    2,
    7,
    6,
    3,
    4,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "马"
    ],
    "4": [
      "龙",
      "兔",
      "马",
      "蛇"
    ],
    "5": [
      "龙",
      "兔",
      "马",
      "蛇",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};