var ensembleData = {
  "time": "2026-09-03 21:32:32",
  "issue": "2026246",
  "code": "22,24,19,10,20,01,30",
  "zodiac": "鸡,羊,鼠,鸡,猪,马,牛",
  "wave": "green,red,red,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026247",
  "ninePool": [
    "猪",
    "鼠",
    "虎",
    "兔",
    "马",
    "猴",
    "羊",
    "龙",
    "牛"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "虎",
    "兔",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "龙",
    "牛"
  ],
  "numbers": [
    32,
    35,
    4,
    8,
    40,
    11,
    44,
    47,
    16,
    20,
    23,
    28,
    13,
    41,
    31,
    43
  ],
  "optTails": [
    7,
    1,
    2,
    6,
    8,
    3,
    4
  ],
  "pools": {
    "3": [
      "猪",
      "兔",
      "猴"
    ],
    "4": [
      "猪",
      "鼠",
      "虎",
      "兔"
    ],
    "5": [
      "猪",
      "鼠",
      "虎",
      "兔",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};