var ensembleData = {
  "time": "2026-07-02 21:32:32",
  "issue": "2026183",
  "code": "23,09,46,37,42,03,24",
  "zodiac": "猴,狗,鸡,马,牛,龙,羊",
  "wave": "red,blue,red,blue,blue,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026184",
  "ninePool": [
    "马",
    "猴",
    "鸡",
    "猪",
    "狗",
    "龙",
    "兔",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "马",
    "猴",
    "鸡",
    "猪",
    "狗",
    "龙"
  ],
  "killZodiacs": [
    "羊",
    "羊"
  ],
  "numbers": [
    32,
    1,
    33,
    37,
    8,
    9,
    44,
    13,
    45,
    20,
    21,
    25,
    47,
    35,
    22,
    46
  ],
  "optTails": [
    1,
    0,
    5,
    6,
    2,
    3,
    7
  ],
  "pools": {
    "3": [
      "马",
      "猪",
      "狗"
    ],
    "4": [
      "马",
      "猴",
      "鸡",
      "猪"
    ],
    "5": [
      "马",
      "猴",
      "鸡",
      "猪",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};