var ensembleData = {
  "time": "2026-09-04 21:32:32",
  "issue": "2026247",
  "code": "03,09,43,29,46,04,40",
  "zodiac": "龙,狗,鼠,虎,鸡,兔,兔",
  "wave": "blue,blue,green,red,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026248",
  "ninePool": [
    "鼠",
    "猪",
    "狗",
    "龙",
    "蛇",
    "兔",
    "马",
    "牛",
    "猴"
  ],
  "sixPool": [
    "鼠",
    "猪",
    "狗",
    "龙",
    "蛇",
    "兔"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "numbers": [
    32,
    33,
    7,
    8,
    9,
    43,
    44,
    45,
    19,
    20,
    21,
    31,
    2,
    15,
    3,
    26
  ],
  "optTails": [
    0,
    7,
    1,
    5,
    6,
    2,
    3
  ],
  "pools": {
    "3": [
      "鼠",
      "狗",
      "猪"
    ],
    "4": [
      "鼠",
      "猪",
      "狗",
      "龙"
    ],
    "5": [
      "鼠",
      "猪",
      "狗",
      "龙",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};