var ensembleData = {
  "time": "2026-08-03 21:32:32",
  "issue": "2026215",
  "code": "19,38,30,13,01,11,14",
  "zodiac": "鼠,蛇,牛,马,马,猴,蛇",
  "wave": "red,green,red,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026216",
  "ninePool": [
    "虎",
    "猴",
    "牛",
    "龙",
    "鸡",
    "猪",
    "羊",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "虎",
    "猴",
    "牛",
    "龙",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "numbers": [
    35,
    3,
    5,
    39,
    41,
    11,
    47,
    15,
    17,
    23,
    27,
    29,
    22,
    46,
    42,
    18
  ],
  "optTails": [
    1,
    4,
    6,
    7,
    8,
    2,
    3
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "龙"
    ],
    "4": [
      "虎",
      "猴",
      "牛",
      "龙"
    ],
    "5": [
      "虎",
      "猴",
      "牛",
      "龙",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};