var ensembleData = {
  "time": "2026-09-16 21:32:32",
  "issue": "2026259",
  "code": "43,33,49,36,19,30,22",
  "zodiac": "鼠,狗,马,羊,鼠,牛,鸡",
  "wave": "green,green,green,blue,red,red,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026260",
  "ninePool": [
    "龙",
    "羊",
    "虎",
    "兔",
    "狗",
    "鼠",
    "牛",
    "蛇",
    "马"
  ],
  "sixPool": [
    "龙",
    "羊",
    "虎",
    "兔",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "羊",
    "鸡"
  ],
  "numbers": [
    3,
    36,
    5,
    39,
    41,
    12,
    15,
    48,
    17,
    24,
    27,
    29,
    33,
    45,
    31,
    43
  ],
  "optTails": [
    2,
    6,
    0,
    1,
    7,
    3,
    5
  ],
  "pools": {
    "3": [
      "羊",
      "龙",
      "虎"
    ],
    "4": [
      "龙",
      "羊",
      "虎",
      "兔"
    ],
    "5": [
      "龙",
      "羊",
      "虎",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};