var ensembleData = {
  "time": "2026-10-27 21:32:32",
  "issue": "2026300",
  "code": "01,29,23,17,18,42,38",
  "zodiac": "马,虎,猴,虎,牛,牛,蛇",
  "wave": "red,red,red,green,red,blue,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026301",
  "ninePool": [
    "牛",
    "羊",
    "鸡",
    "龙",
    "猴",
    "兔",
    "马",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "牛",
    "羊",
    "鸡",
    "龙",
    "猴",
    "兔"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "numbers": [
    35,
    36,
    6,
    42,
    11,
    12,
    47,
    48,
    18,
    23,
    24,
    30,
    34,
    4,
    39,
    27
  ],
  "optTails": [
    8,
    5,
    6,
    7,
    1,
    4,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "羊",
      "猴"
    ],
    "4": [
      "牛",
      "羊",
      "鸡",
      "龙"
    ],
    "5": [
      "牛",
      "羊",
      "鸡",
      "龙",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};