var ensembleData = {
  "time": "2026-07-03 21:32:32",
  "issue": "2026184",
  "code": "44,24,11,36,25,20,01",
  "zodiac": "猪,羊,猴,羊,马,猪,马",
  "wave": "green,red,green,blue,blue,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026185",
  "ninePool": [
    "猴",
    "牛",
    "龙",
    "羊",
    "鼠",
    "兔",
    "虎",
    "鸡",
    "狗"
  ],
  "sixPool": [
    "猴",
    "牛",
    "龙",
    "羊",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    35,
    3,
    6,
    39,
    42,
    11,
    47,
    15,
    18,
    23,
    27,
    30,
    36,
    12,
    43,
    48
  ],
  "optTails": [
    1,
    4,
    6,
    8,
    2,
    3,
    7
  ],
  "pools": {
    "3": [
      "猴",
      "牛",
      "龙"
    ],
    "4": [
      "猴",
      "牛",
      "龙",
      "羊"
    ],
    "5": [
      "猴",
      "牛",
      "龙",
      "羊",
      "鼠"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};