var ensembleData = {
  "time": "2026-08-17 21:32:32",
  "issue": "2026229",
  "code": "11,07,15,13,33,16,38",
  "zodiac": "猴,鼠,龙,马,狗,兔,蛇",
  "wave": "green,red,blue,red,green,green,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026230",
  "ninePool": [
    "猪",
    "虎",
    "羊",
    "龙",
    "牛",
    "鼠",
    "猴",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "猪",
    "虎",
    "羊",
    "龙",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "numbers": [
    35,
    36,
    3,
    39,
    11,
    12,
    47,
    48,
    15,
    23,
    24,
    27,
    20,
    44,
    41,
    29
  ],
  "optTails": [
    1,
    3,
    6,
    7,
    9,
    0,
    4
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "龙"
    ],
    "4": [
      "猪",
      "虎",
      "羊",
      "龙"
    ],
    "5": [
      "猪",
      "虎",
      "羊",
      "龙",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};