var ensembleData = {
  "time": "2026-10-29 21:32:32",
  "issue": "2026302",
  "code": "10,02,14,13,11,12,45",
  "zodiac": "鸡,蛇,蛇,马,猴,羊,狗",
  "wave": "blue,red,blue,red,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026303",
  "ninePool": [
    "鸡",
    "羊",
    "鼠",
    "马",
    "虎",
    "牛",
    "猴",
    "兔",
    "龙"
  ],
  "sixPool": [
    "羊",
    "鸡",
    "鼠",
    "马",
    "虎",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "狗"
  ],
  "numbers": [
    34,
    36,
    6,
    10,
    42,
    12,
    46,
    48,
    18,
    22,
    24,
    30,
    41,
    31,
    37,
    1
  ],
  "optTails": [
    3,
    8,
    7,
    1,
    2,
    4,
    6
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "牛"
    ],
    "4": [
      "羊",
      "鸡",
      "鼠",
      "马"
    ],
    "5": [
      "羊",
      "鸡",
      "鼠",
      "马",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};