var ensembleData = {
  "time": "2026-07-30 21:32:32",
  "issue": "2026211",
  "code": "13,12,39,37,38,08,01",
  "zodiac": "马,羊,龙,马,蛇,猪,马",
  "wave": "red,red,green,blue,green,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026212",
  "ninePool": [
    "猴",
    "猪",
    "牛",
    "鸡",
    "狗",
    "羊",
    "鼠",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "猴",
    "猪",
    "牛",
    "鸡",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    32,
    35,
    6,
    8,
    42,
    11,
    44,
    47,
    18,
    20,
    23,
    30,
    34,
    12,
    22,
    46
  ],
  "optTails": [
    1,
    3,
    7,
    8,
    2,
    4,
    6
  ],
  "pools": {
    "3": [
      "猴",
      "猪",
      "牛"
    ],
    "4": [
      "猴",
      "猪",
      "牛",
      "鸡"
    ],
    "5": [
      "猴",
      "猪",
      "牛",
      "鸡",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};