var ensembleData = {
  "time": "2026-08-28 21:32:32",
  "issue": "2026240",
  "code": "02,34,22,26,28,37,27",
  "zodiac": "蛇,鸡,鸡,蛇,兔,马,龙",
  "wave": "red,red,green,blue,green,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026241",
  "ninePool": [
    "兔",
    "马",
    "鸡",
    "龙",
    "羊",
    "蛇",
    "猴",
    "鼠",
    "牛"
  ],
  "sixPool": [
    "兔",
    "马",
    "鸡",
    "龙",
    "羊",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    1,
    3,
    4,
    37,
    39,
    40,
    13,
    15,
    16,
    25,
    27,
    28,
    34,
    46,
    10,
    24
  ],
  "optTails": [
    2,
    0,
    9,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "马",
      "龙"
    ],
    "4": [
      "兔",
      "马",
      "鸡",
      "龙"
    ],
    "5": [
      "兔",
      "马",
      "鸡",
      "龙",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};