var ensembleData = {
  "time": "2026-08-10 21:32:32",
  "issue": "2026222",
  "code": "49,14,47,27,18,38,26",
  "zodiac": "马,蛇,猴,龙,牛,蛇,蛇",
  "wave": "green,blue,blue,green,red,green,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026223",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "兔",
    "龙",
    "羊",
    "狗",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "兔",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "numbers": [
    35,
    4,
    3,
    39,
    40,
    11,
    47,
    16,
    15,
    23,
    27,
    28,
    12,
    22,
    42,
    18
  ],
  "optTails": [
    4,
    6,
    7,
    1,
    3,
    8,
    2
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "龙"
    ],
    "4": [
      "鸡",
      "牛",
      "猴",
      "兔"
    ],
    "5": [
      "鸡",
      "牛",
      "猴",
      "兔",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};