var ensembleData = {
  "time": "2026-08-01 21:32:32",
  "issue": "2026213",
  "code": "09,05,12,22,01,15,35",
  "zodiac": "狗,虎,羊,鸡,马,龙,猴",
  "wave": "blue,green,red,green,red,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026214",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "鼠",
    "虎",
    "羊",
    "猴",
    "马",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "牛",
    "鼠",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "numbers": [
    2,
    34,
    38,
    6,
    42,
    10,
    14,
    46,
    18,
    22,
    26,
    30,
    17,
    48,
    24,
    7
  ],
  "optTails": [
    1,
    5,
    9,
    6,
    7,
    8,
    4
  ],
  "pools": {
    "3": [
      "蛇",
      "牛",
      "鸡"
    ],
    "4": [
      "鸡",
      "蛇",
      "牛",
      "鼠"
    ],
    "5": [
      "鸡",
      "蛇",
      "牛",
      "鼠",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};