var ensembleData = {
  "time": "2026-08-02 21:32:32",
  "issue": "2026214",
  "code": "29,30,27,38,43,31,04",
  "zodiac": "虎,牛,龙,蛇,鼠,鼠,兔",
  "wave": "red,red,green,green,green,blue,blue",
  "teSx": "兔",
  "teWei": 4,
  "nextIssue": "2026215",
  "ninePool": [
    "马",
    "猴",
    "牛",
    "蛇",
    "鸡",
    "鼠",
    "羊",
    "狗",
    "龙"
  ],
  "sixPool": [
    "马",
    "猴",
    "牛",
    "蛇",
    "鼠",
    "鸡"
  ],
  "killZodiacs": [
    "狗",
    "兔"
  ],
  "numbers": [
    1,
    35,
    37,
    6,
    42,
    11,
    13,
    47,
    18,
    23,
    25,
    30,
    46,
    43,
    10,
    26
  ],
  "optTails": [
    1,
    3,
    5,
    6,
    7,
    8,
    0
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "猴"
    ],
    "4": [
      "马",
      "猴",
      "牛",
      "蛇"
    ],
    "5": [
      "马",
      "猴",
      "牛",
      "蛇",
      "鼠"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};