var ensembleData = {
  "time": "2026-07-06 21:32:32",
  "issue": "2026187",
  "code": "23,12,36,38,27,22,01",
  "zodiac": "猴,羊,羊,蛇,龙,鸡,马",
  "wave": "red,red,blue,green,green,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026188",
  "ninePool": [
    "猪",
    "牛",
    "龙",
    "鼠",
    "兔",
    "狗",
    "鸡",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "牛",
    "龙",
    "鼠",
    "兔",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    32,
    4,
    6,
    8,
    40,
    42,
    44,
    16,
    18,
    20,
    28,
    30,
    33,
    43,
    27,
    7
  ],
  "optTails": [
    1,
    3,
    4,
    6,
    8,
    2,
    7
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "兔"
    ],
    "4": [
      "猪",
      "牛",
      "龙",
      "鼠"
    ],
    "5": [
      "猪",
      "牛",
      "龙",
      "鼠",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};