var ensembleData = {
  "time": "2026-08-08 21:32:32",
  "issue": "2026220",
  "code": "27,39,04,12,38,25,48",
  "zodiac": "龙,龙,兔,羊,蛇,马,羊",
  "wave": "green,green,blue,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026221",
  "ninePool": [
    "鼠",
    "牛",
    "兔",
    "狗",
    "猪",
    "蛇",
    "马",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "鼠",
    "牛",
    "兔",
    "狗",
    "蛇",
    "猪"
  ],
  "killZodiacs": [
    "牛",
    "羊"
  ],
  "numbers": [
    4,
    6,
    7,
    40,
    42,
    43,
    16,
    18,
    19,
    28,
    30,
    31,
    20,
    33,
    45,
    2
  ],
  "optTails": [
    4,
    6,
    1,
    3,
    5,
    0,
    2
  ],
  "pools": {
    "3": [
      "鼠",
      "牛",
      "兔"
    ],
    "4": [
      "鼠",
      "牛",
      "兔",
      "狗"
    ],
    "5": [
      "鼠",
      "牛",
      "兔",
      "狗",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};