var ensembleData = {
  "time": "2026-07-15 21:32:32",
  "issue": "2026196",
  "code": "03,37,24,10,41,19,39",
  "zodiac": "龙,马,羊,鸡,虎,鼠,龙",
  "wave": "blue,blue,red,blue,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026197",
  "ninePool": [
    "猴",
    "羊",
    "鸡",
    "虎",
    "牛",
    "兔",
    "马",
    "狗",
    "猪"
  ],
  "sixPool": [
    "猴",
    "羊",
    "鸡",
    "虎",
    "牛",
    "兔"
  ],
  "killZodiacs": [
    "兔",
    "龙"
  ],
  "numbers": [
    35,
    36,
    5,
    41,
    11,
    12,
    47,
    48,
    17,
    23,
    24,
    29,
    34,
    4,
    22,
    30
  ],
  "optTails": [
    1,
    0,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "虎"
    ],
    "4": [
      "猴",
      "羊",
      "鸡",
      "虎"
    ],
    "5": [
      "猴",
      "羊",
      "鸡",
      "虎",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};