var ensembleData = {
  "time": "2026-10-22 21:32:32",
  "issue": "2026295",
  "code": "22,28,33,17,13,47,25",
  "zodiac": "鸡,兔,狗,虎,马,猴,马",
  "wave": "green,green,green,green,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026296",
  "ninePool": [
    "龙",
    "虎",
    "狗",
    "猴",
    "羊",
    "鸡",
    "鼠",
    "牛",
    "猪"
  ],
  "sixPool": [
    "龙",
    "虎",
    "狗",
    "猴",
    "羊",
    "鸡"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "numbers": [
    3,
    5,
    6,
    39,
    41,
    42,
    15,
    17,
    18,
    27,
    29,
    30,
    34,
    12,
    46,
    21,
    6,
    42,
    18,
    30
  ],
  "optTails": [
    8,
    0,
    4,
    6,
    1,
    2,
    3
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "牛"
    ],
    "4": [
      "龙",
      "虎",
      "狗",
      "猴"
    ],
    "5": [
      "龙",
      "虎",
      "狗",
      "猴",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};