var ensembleData = {
  "time": "2026-09-07 21:32:32",
  "issue": "2026250",
  "code": "10,06,39,47,37,17,14",
  "zodiac": "鸡,牛,龙,猴,马,虎,蛇",
  "wave": "blue,green,green,blue,blue,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026251",
  "ninePool": [
    "虎",
    "牛",
    "马",
    "猴",
    "鸡",
    "猪",
    "羊",
    "蛇",
    "鼠"
  ],
  "sixPool": [
    "虎",
    "牛",
    "马",
    "猴",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "狗",
    "蛇"
  ],
  "numbers": [
    1,
    5,
    37,
    6,
    41,
    42,
    13,
    17,
    18,
    25,
    29,
    30,
    47,
    35,
    11,
    46
  ],
  "optTails": [
    0,
    1,
    3,
    6,
    8,
    5,
    7
  ],
  "pools": {
    "3": [
      "虎",
      "马",
      "牛"
    ],
    "4": [
      "虎",
      "牛",
      "马",
      "猴"
    ],
    "5": [
      "虎",
      "牛",
      "马",
      "猴",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};