var ensembleData = {
  "time": "2026-07-10 21:32:32",
  "issue": "2026191",
  "code": "19,43,39,24,16,26,29",
  "zodiac": "鼠,鼠,龙,羊,兔,蛇,虎",
  "wave": "red,green,green,red,green,blue,red",
  "teSx": "虎",
  "teWei": 9,
  "nextIssue": "2026192",
  "ninePool": [
    "狗",
    "鸡",
    "猪",
    "马",
    "鼠",
    "猴",
    "蛇",
    "兔",
    "羊"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "猪",
    "马",
    "鼠",
    "猴"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "numbers": [
    33,
    34,
    7,
    9,
    10,
    43,
    45,
    46,
    19,
    21,
    22,
    31,
    47,
    20,
    13,
    37
  ],
  "optTails": [
    1,
    6,
    3,
    4,
    9,
    0,
    7
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "鼠"
    ],
    "4": [
      "狗",
      "鸡",
      "猪",
      "马"
    ],
    "5": [
      "狗",
      "鸡",
      "猪",
      "马",
      "鼠"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};