var ensembleData = {
  "time": "2026-10-26 21:32:32",
  "issue": "2026299",
  "code": "12,19,28,32,05,42,23",
  "zodiac": "羊,鼠,兔,猪,虎,牛,猴",
  "wave": "red,red,green,green,green,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026300",
  "ninePool": [
    "蛇",
    "龙",
    "羊",
    "马",
    "兔",
    "牛",
    "鸡",
    "猴",
    "狗"
  ],
  "sixPool": [
    "蛇",
    "龙",
    "羊",
    "马",
    "兔",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    2,
    3,
    36,
    38,
    39,
    12,
    14,
    15,
    48,
    24,
    26,
    27,
    6,
    4,
    37,
    16
  ],
  "optTails": [
    3,
    0,
    6,
    7,
    1,
    4,
    9
  ],
  "pools": {
    "3": [
      "蛇",
      "羊",
      "龙"
    ],
    "4": [
      "蛇",
      "龙",
      "羊",
      "马"
    ],
    "5": [
      "蛇",
      "龙",
      "羊",
      "马",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};