var ensembleData = {
  "time": "2026-10-25 21:32:32",
  "issue": "2026298",
  "code": "31,36,40,34,37,43,08",
  "zodiac": "鼠,羊,兔,鸡,马,鼠,猪",
  "wave": "blue,blue,red,red,blue,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026299",
  "ninePool": [
    "猴",
    "龙",
    "马",
    "蛇",
    "羊",
    "鸡",
    "猪",
    "狗",
    "牛"
  ],
  "sixPool": [
    "猴",
    "龙",
    "马",
    "蛇",
    "羊",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "猪"
  ],
  "numbers": [
    1,
    3,
    35,
    37,
    39,
    11,
    13,
    47,
    15,
    23,
    25,
    27,
    34,
    26,
    12,
    46
  ],
  "optTails": [
    8,
    3,
    6,
    7,
    1,
    2,
    4
  ],
  "pools": {
    "3": [
      "猴",
      "龙",
      "马"
    ],
    "4": [
      "猴",
      "龙",
      "马",
      "蛇"
    ],
    "5": [
      "猴",
      "龙",
      "马",
      "蛇",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};