var ensembleData = {
  "time": "2026-07-13 21:32:32",
  "issue": "2026194",
  "code": "30,21,22,15,04,34,26",
  "zodiac": "牛,狗,鸡,龙,兔,鸡,蛇",
  "wave": "red,green,green,blue,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026195",
  "ninePool": [
    "鸡",
    "兔",
    "狗",
    "猪",
    "牛",
    "龙",
    "羊",
    "虎",
    "马"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "狗",
    "猪",
    "牛",
    "龙"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    33,
    34,
    4,
    40,
    9,
    10,
    45,
    46,
    16,
    21,
    22,
    28,
    20,
    30,
    42,
    27
  ],
  "optTails": [
    6,
    5,
    1,
    3,
    0,
    2,
    7
  ],
  "pools": {
    "3": [
      "鸡",
      "兔",
      "狗"
    ],
    "4": [
      "鸡",
      "兔",
      "狗",
      "猪"
    ],
    "5": [
      "鸡",
      "兔",
      "狗",
      "猪",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};