var ensembleData = {
  "time": "2026-08-22 21:32:32",
  "issue": "2026234",
  "code": "25,30,37,19,07,17,39",
  "zodiac": "马,牛,马,鼠,鼠,虎,龙",
  "wave": "blue,red,blue,red,red,green,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026235",
  "ninePool": [
    "虎",
    "鼠",
    "鸡",
    "猪",
    "猴",
    "马",
    "蛇",
    "羊",
    "兔"
  ],
  "sixPool": [
    "虎",
    "鼠",
    "猪",
    "鸡",
    "猴",
    "马"
  ],
  "killZodiacs": [
    "狗",
    "龙"
  ],
  "numbers": [
    32,
    5,
    7,
    8,
    41,
    43,
    44,
    17,
    19,
    20,
    29,
    31,
    11,
    13,
    10,
    25
  ],
  "optTails": [
    6,
    7,
    0,
    1,
    3,
    8,
    5
  ],
  "pools": {
    "3": [
      "鼠",
      "虎",
      "猪"
    ],
    "4": [
      "虎",
      "鼠",
      "猪",
      "鸡"
    ],
    "5": [
      "虎",
      "鼠",
      "猪",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};