var ensembleData = {
  "time": "2026-10-15 21:32:32",
  "issue": "2026288",
  "code": "14,48,05,17,46,21,25",
  "zodiac": "蛇,羊,虎,虎,鸡,狗,马",
  "wave": "blue,blue,green,green,red,green,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026289",
  "ninePool": [
    "狗",
    "虎",
    "牛",
    "鼠",
    "兔",
    "龙",
    "羊",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "狗",
    "虎",
    "牛",
    "鼠",
    "兔",
    "龙"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "numbers": [
    33,
    5,
    6,
    9,
    41,
    42,
    45,
    17,
    18,
    21,
    29,
    30,
    3,
    31,
    4,
    43
  ],
  "optTails": [
    8,
    2,
    3,
    4,
    1,
    6,
    7
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "牛"
    ],
    "4": [
      "狗",
      "虎",
      "牛",
      "鼠"
    ],
    "5": [
      "狗",
      "虎",
      "牛",
      "鼠",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};