var ensembleData = {
  "time": "2026-07-12 21:32:32",
  "issue": "2026193",
  "code": "02,49,25,11,45,29,09",
  "zodiac": "蛇,马,马,猴,狗,虎,狗",
  "wave": "red,green,blue,green,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026194",
  "ninePool": [
    "猪",
    "牛",
    "鼠",
    "虎",
    "猴",
    "羊",
    "龙",
    "马",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "牛",
    "鼠",
    "虎",
    "猴",
    "羊"
  ],
  "killZodiacs": [
    "龙",
    "狗"
  ],
  "numbers": [
    32,
    35,
    6,
    8,
    42,
    11,
    44,
    47,
    18,
    20,
    23,
    30,
    17,
    12,
    43,
    48
  ],
  "optTails": [
    1,
    3,
    0,
    2,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "猴"
    ],
    "4": [
      "猪",
      "牛",
      "鼠",
      "虎"
    ],
    "5": [
      "猪",
      "牛",
      "鼠",
      "虎",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};