var ensembleData = {
  "time": "2026-07-20 21:32:32",
  "issue": "2026201",
  "code": "46,28,19,38,31,25,32",
  "zodiac": "鸡,兔,鼠,蛇,鼠,马,猪",
  "wave": "red,green,red,green,blue,blue,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026202",
  "ninePool": [
    "虎",
    "猴",
    "鼠",
    "牛",
    "鸡",
    "兔",
    "蛇",
    "马",
    "羊"
  ],
  "sixPool": [
    "虎",
    "猴",
    "鼠",
    "牛",
    "鸡",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "猪"
  ],
  "numbers": [
    35,
    5,
    7,
    41,
    11,
    43,
    47,
    17,
    19,
    23,
    29,
    31,
    34,
    4,
    22,
    30
  ],
  "optTails": [
    6,
    2,
    8,
    0,
    1,
    3,
    4
  ],
  "pools": {
    "3": [
      "猴",
      "虎",
      "鼠"
    ],
    "4": [
      "虎",
      "猴",
      "鼠",
      "牛"
    ],
    "5": [
      "虎",
      "猴",
      "鼠",
      "牛",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};