var ensembleData = {
  "time": "2026-10-01 21:32:32",
  "issue": "2026274",
  "code": "12,16,32,05,39,36,33",
  "zodiac": "羊,兔,猪,虎,龙,羊,狗",
  "wave": "red,green,green,green,green,blue,green",
  "teSx": "狗",
  "teWei": 3,
  "nextIssue": "2026275",
  "ninePool": [
    "羊",
    "猪",
    "鸡",
    "鼠",
    "猴",
    "牛",
    "蛇",
    "狗",
    "马"
  ],
  "sixPool": [
    "羊",
    "猪",
    "鸡",
    "鼠",
    "猴",
    "牛"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "numbers": [
    32,
    34,
    36,
    8,
    10,
    12,
    44,
    46,
    48,
    20,
    22,
    24,
    31,
    6,
    43,
    11
  ],
  "optTails": [
    0,
    2,
    3,
    8,
    1,
    4,
    6
  ],
  "pools": {
    "3": [
      "羊",
      "猪",
      "鸡"
    ],
    "4": [
      "羊",
      "猪",
      "鸡",
      "鼠"
    ],
    "5": [
      "羊",
      "猪",
      "鸡",
      "鼠",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};