var ensembleData = {
  "time": "2026-07-22 21:32:32",
  "issue": "2026203",
  "code": "12,11,31,03,44,37,25",
  "zodiac": "羊,猴,鼠,龙,猪,马,马",
  "wave": "red,green,blue,blue,green,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026204",
  "ninePool": [
    "虎",
    "龙",
    "牛",
    "鸡",
    "猴",
    "鼠",
    "狗",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "虎",
    "龙",
    "牛",
    "鸡",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "numbers": [
    34,
    3,
    5,
    39,
    41,
    10,
    46,
    15,
    17,
    22,
    27,
    29,
    11,
    42,
    31,
    18
  ],
  "optTails": [
    5,
    6,
    9,
    2,
    8,
    1,
    4
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "鸡"
    ],
    "4": [
      "虎",
      "龙",
      "牛",
      "鸡"
    ],
    "5": [
      "虎",
      "龙",
      "牛",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};