var ensembleData = {
  "time": "2026-10-14 21:32:32",
  "issue": "2026287",
  "code": "19,47,38,35,06,17,08",
  "zodiac": "鼠,猴,蛇,猴,牛,虎,猪",
  "wave": "red,blue,green,red,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026288",
  "ninePool": [
    "马",
    "蛇",
    "羊",
    "虎",
    "兔",
    "牛",
    "鸡",
    "猴",
    "猪"
  ],
  "sixPool": [
    "马",
    "蛇",
    "羊",
    "虎",
    "牛",
    "兔"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    1,
    2,
    36,
    37,
    38,
    12,
    13,
    14,
    48,
    24,
    25,
    26,
    41,
    29,
    6,
    4
  ],
  "optTails": [
    2,
    8,
    4,
    5,
    9,
    1,
    6
  ],
  "pools": {
    "3": [
      "马",
      "蛇",
      "羊"
    ],
    "4": [
      "马",
      "蛇",
      "羊",
      "虎"
    ],
    "5": [
      "马",
      "蛇",
      "羊",
      "虎",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};