var ensembleData = {
  "time": "2026-09-02 21:32:32",
  "issue": "2026245",
  "code": "22,23,14,02,13,38,18",
  "zodiac": "鸡,猴,蛇,蛇,马,蛇,牛",
  "wave": "green,red,blue,red,red,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026246",
  "ninePool": [
    "猪",
    "虎",
    "猴",
    "蛇",
    "鼠",
    "羊",
    "狗",
    "马",
    "龙"
  ],
  "sixPool": [
    "猪",
    "虎",
    "猴",
    "蛇",
    "羊",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "牛"
  ],
  "numbers": [
    32,
    35,
    5,
    8,
    41,
    11,
    44,
    47,
    17,
    20,
    23,
    29,
    2,
    24,
    36,
    14
  ],
  "optTails": [
    1,
    9,
    2,
    5,
    6,
    8,
    4
  ],
  "pools": {
    "3": [
      "猪",
      "猴",
      "虎"
    ],
    "4": [
      "猪",
      "虎",
      "猴",
      "蛇"
    ],
    "5": [
      "猪",
      "虎",
      "猴",
      "蛇",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};