var ensembleData = {
  "time": "2026-06-27 21:32:32",
  "issue": "2026178",
  "code": "26,46,22,44,31,17,18",
  "zodiac": "蛇,鸡,鸡,猪,鼠,虎,牛",
  "wave": "blue,red,green,green,blue,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026179",
  "ninePool": [
    "猴",
    "兔",
    "虎",
    "鼠",
    "狗",
    "猪",
    "龙",
    "马",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "兔",
    "虎",
    "鼠",
    "狗",
    "猪"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    35,
    4,
    5,
    40,
    41,
    11,
    47,
    16,
    17,
    23,
    28,
    29,
    20,
    33,
    43,
    9
  ],
  "optTails": [
    4,
    6,
    8,
    0,
    3,
    2,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "猴",
      "虎"
    ],
    "4": [
      "猴",
      "兔",
      "虎",
      "鼠"
    ],
    "5": [
      "猴",
      "兔",
      "虎",
      "鼠",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};