var ensembleData = {
  "time": "2026-10-30 21:32:32",
  "issue": "2026303",
  "code": "08,28,40,03,38,49,17",
  "zodiac": "猪,兔,兔,龙,蛇,马,虎",
  "wave": "red,green,red,blue,green,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026304",
  "ninePool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "马",
    "蛇",
    "狗",
    "鸡",
    "鼠"
  ],
  "sixPool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "马",
    "蛇"
  ],
  "killZodiacs": [
    "鼠",
    "虎"
  ],
  "numbers": [
    32,
    35,
    36,
    8,
    11,
    12,
    44,
    47,
    48,
    20,
    23,
    24,
    4,
    26,
    16,
    1
  ],
  "optTails": [
    3,
    8,
    0,
    1,
    2,
    4,
    6
  ],
  "pools": {
    "3": [
      "羊",
      "猪",
      "猴"
    ],
    "4": [
      "羊",
      "猴",
      "猪",
      "兔"
    ],
    "5": [
      "羊",
      "猴",
      "猪",
      "兔",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};