var ensembleData = {
  "time": "2026-06-24 21:32:32",
  "issue": "2026175",
  "code": "07,19,30,29,28,25,26",
  "zodiac": "鼠,鼠,牛,虎,兔,马,蛇",
  "wave": "red,red,red,red,green,blue,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026176",
  "ninePool": [
    "猴",
    "狗",
    "羊",
    "龙",
    "鸡",
    "牛",
    "鼠",
    "猪",
    "兔"
  ],
  "sixPool": [
    "猴",
    "狗",
    "羊",
    "龙",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "numbers": [
    47,
    11,
    33,
    23,
    21,
    36,
    9,
    24,
    10,
    30,
    27,
    3,
    34,
    46,
    39,
    6
  ],
  "optTails": [
    0,
    1,
    3,
    7,
    4,
    6,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "狗"
    ],
    "4": [
      "猴",
      "狗",
      "羊",
      "龙"
    ],
    "5": [
      "猴",
      "狗",
      "羊",
      "龙",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};