var ensembleData = {
  "time": "2026-08-21 21:32:32",
  "issue": "2026233",
  "code": "18,41,05,49,04,34,07",
  "zodiac": "牛,虎,虎,马,兔,鸡,鼠",
  "wave": "red,blue,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026234",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "狗",
    "羊",
    "蛇",
    "猴",
    "虎",
    "兔"
  ],
  "sixPool": [
    "龙",
    "马",
    "鸡",
    "狗",
    "羊",
    "蛇"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    33,
    1,
    3,
    37,
    39,
    9,
    45,
    13,
    15,
    21,
    25,
    27,
    34,
    24,
    14,
    48
  ],
  "optTails": [
    6,
    7,
    1,
    8,
    9,
    4,
    5
  ],
  "pools": {
    "3": [
      "龙",
      "狗",
      "马"
    ],
    "4": [
      "龙",
      "马",
      "鸡",
      "狗"
    ],
    "5": [
      "龙",
      "马",
      "鸡",
      "狗",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};