var ensembleData = {
  "time": "2026-07-29 21:32:32",
  "issue": "2026210",
  "code": "40,37,15,17,42,48,49",
  "zodiac": "兔,马,龙,虎,牛,羊,马",
  "wave": "red,blue,blue,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026211",
  "ninePool": [
    "牛",
    "龙",
    "虎",
    "兔",
    "猴",
    "羊",
    "鸡",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "牛",
    "龙",
    "虎",
    "兔",
    "猴",
    "羊"
  ],
  "killZodiacs": [
    "兔",
    "马"
  ],
  "numbers": [
    3,
    35,
    6,
    39,
    42,
    11,
    15,
    47,
    18,
    23,
    27,
    30,
    17,
    12,
    4,
    41
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    7,
    8,
    4
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "牛"
    ],
    "4": [
      "牛",
      "龙",
      "虎",
      "兔"
    ],
    "5": [
      "牛",
      "龙",
      "虎",
      "兔",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};