var ensembleData = {
  "time": "2026-09-30 21:32:32",
  "issue": "2026273",
  "code": "30,03,25,28,06,17,05",
  "zodiac": "牛,龙,马,兔,牛,虎,虎",
  "wave": "red,blue,blue,green,green,green,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026274",
  "ninePool": [
    "狗",
    "马",
    "鸡",
    "兔",
    "龙",
    "猪",
    "蛇",
    "猴",
    "虎"
  ],
  "sixPool": [
    "狗",
    "马",
    "鸡",
    "兔",
    "猪",
    "龙"
  ],
  "killZodiacs": [
    "牛",
    "虎"
  ],
  "numbers": [
    33,
    1,
    4,
    37,
    40,
    9,
    45,
    13,
    16,
    21,
    25,
    28,
    34,
    10,
    3,
    44
  ],
  "optTails": [
    0,
    2,
    5,
    1,
    3,
    4,
    6
  ],
  "pools": {
    "3": [
      "狗",
      "兔",
      "马"
    ],
    "4": [
      "狗",
      "马",
      "鸡",
      "兔"
    ],
    "5": [
      "狗",
      "马",
      "鸡",
      "兔",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};