var ensembleData = {
  "time": "2026-10-11 21:32:32",
  "issue": "2026284",
  "code": "04,35,22,48,03,18,32",
  "zodiac": "兔,猴,鸡,羊,龙,牛,猪",
  "wave": "blue,red,green,blue,blue,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026285",
  "ninePool": [
    "羊",
    "蛇",
    "马",
    "猴",
    "兔",
    "鸡",
    "狗",
    "鼠",
    "牛"
  ],
  "sixPool": [
    "羊",
    "蛇",
    "马",
    "猴",
    "兔",
    "鸡"
  ],
  "killZodiacs": [
    "蛇",
    "猪"
  ],
  "numbers": [
    1,
    2,
    36,
    37,
    38,
    12,
    13,
    14,
    48,
    24,
    25,
    26,
    34,
    4,
    16,
    46
  ],
  "optTails": [
    2,
    1,
    4,
    5,
    8,
    6,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "马",
      "蛇"
    ],
    "4": [
      "羊",
      "蛇",
      "马",
      "猴"
    ],
    "5": [
      "羊",
      "蛇",
      "马",
      "猴",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};