var ensembleData = {
  "time": "2026-07-27 21:32:32",
  "issue": "2026208",
  "code": "07,48,40,35,23,28,19",
  "zodiac": "鼠,羊,兔,猴,猴,兔,鼠",
  "wave": "red,blue,red,red,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026209",
  "ninePool": [
    "牛",
    "蛇",
    "猪",
    "鸡",
    "羊",
    "龙",
    "鼠",
    "兔",
    "马"
  ],
  "sixPool": [
    "牛",
    "蛇",
    "猪",
    "鸡",
    "羊",
    "龙"
  ],
  "killZodiacs": [
    "蛇",
    "鼠"
  ],
  "numbers": [
    32,
    2,
    38,
    6,
    8,
    42,
    44,
    14,
    18,
    20,
    26,
    30,
    34,
    12,
    22,
    46
  ],
  "optTails": [
    1,
    2,
    3,
    6,
    7,
    4,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "猪",
      "牛"
    ],
    "4": [
      "牛",
      "蛇",
      "猪",
      "鸡"
    ],
    "5": [
      "牛",
      "蛇",
      "猪",
      "鸡",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};