var ensembleData = {
  "time": "2026-08-23 21:32:32",
  "issue": "2026235",
  "code": "27,26,35,17,44,21,32",
  "zodiac": "龙,蛇,猴,虎,猪,狗,猪",
  "wave": "green,blue,red,green,green,green,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026236",
  "ninePool": [
    "蛇",
    "羊",
    "兔",
    "鸡",
    "猴",
    "马",
    "牛",
    "虎",
    "龙"
  ],
  "sixPool": [
    "蛇",
    "兔",
    "羊",
    "鸡",
    "猴",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    2,
    35,
    4,
    38,
    40,
    11,
    14,
    47,
    16,
    23,
    26,
    28,
    34,
    13,
    24,
    48
  ],
  "optTails": [
    2,
    6,
    7,
    3,
    8,
    1,
    4
  ],
  "pools": {
    "3": [
      "蛇",
      "兔",
      "猴"
    ],
    "4": [
      "蛇",
      "兔",
      "羊",
      "鸡"
    ],
    "5": [
      "蛇",
      "兔",
      "羊",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};