var ensembleData = {
  "time": "2026-09-11 21:32:32",
  "issue": "2026254",
  "code": "26,44,35,06,16,10,02",
  "zodiac": "蛇,猪,猴,牛,兔,鸡,蛇",
  "wave": "blue,green,red,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026255",
  "ninePool": [
    "马",
    "鼠",
    "猴",
    "狗",
    "鸡",
    "羊",
    "猪",
    "虎",
    "龙"
  ],
  "sixPool": [
    "马",
    "鼠",
    "猴",
    "鸡",
    "狗",
    "羊"
  ],
  "killZodiacs": [
    "猴",
    "蛇"
  ],
  "numbers": [
    34,
    35,
    7,
    10,
    11,
    43,
    46,
    47,
    19,
    22,
    23,
    31,
    33,
    13,
    45,
    24
  ],
  "optTails": [
    3,
    4,
    6,
    8,
    1,
    5,
    7
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "鼠"
    ],
    "4": [
      "马",
      "鼠",
      "猴",
      "鸡"
    ],
    "5": [
      "马",
      "鼠",
      "猴",
      "鸡",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};