var ensembleData = {
  "time": "2026-10-06 21:32:32",
  "issue": "2026279",
  "code": "29,32,47,38,06,26,10",
  "zodiac": "虎,猪,猴,蛇,牛,蛇,鸡",
  "wave": "red,green,blue,green,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026280",
  "ninePool": [
    "兔",
    "猪",
    "虎",
    "牛",
    "羊",
    "狗",
    "马",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "兔",
    "猪",
    "虎",
    "牛",
    "狗",
    "羊"
  ],
  "killZodiacs": [
    "猴",
    "鸡"
  ],
  "numbers": [
    32,
    4,
    5,
    8,
    40,
    41,
    44,
    16,
    17,
    20,
    28,
    29,
    36,
    6,
    48,
    18
  ],
  "optTails": [
    5,
    1,
    3,
    4,
    7,
    6,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "猪",
      "虎"
    ],
    "4": [
      "兔",
      "猪",
      "虎",
      "牛"
    ],
    "5": [
      "兔",
      "猪",
      "虎",
      "牛",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};