var ensembleData = {
  "time": "2026-10-13 21:32:32",
  "issue": "2026286",
  "code": "37,49,28,08,29,01,24",
  "zodiac": "马,马,兔,猪,虎,马,羊",
  "wave": "blue,green,green,red,red,red,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026287",
  "ninePool": [
    "狗",
    "虎",
    "鸡",
    "兔",
    "马",
    "龙",
    "猴",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "狗",
    "虎",
    "鸡",
    "兔",
    "马",
    "龙"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    33,
    34,
    5,
    9,
    41,
    10,
    45,
    46,
    17,
    21,
    22,
    29,
    13,
    28,
    3,
    4
  ],
  "optTails": [
    0,
    2,
    1,
    3,
    4,
    8,
    7
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "鸡"
    ],
    "4": [
      "狗",
      "虎",
      "鸡",
      "兔"
    ],
    "5": [
      "狗",
      "虎",
      "鸡",
      "兔",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};