var ensembleData = {
  "time": "2026-07-08 21:32:32",
  "issue": "2026189",
  "code": "45,12,37,20,38,43,15",
  "zodiac": "狗,羊,马,猪,蛇,鼠,龙",
  "wave": "red,red,blue,blue,green,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026190",
  "ninePool": [
    "鸡",
    "鼠",
    "猴",
    "牛",
    "羊",
    "马",
    "猪",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "猴",
    "牛",
    "羊",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "龙"
  ],
  "numbers": [
    34,
    35,
    7,
    10,
    43,
    11,
    46,
    47,
    19,
    22,
    23,
    31,
    12,
    42,
    13,
    48
  ],
  "optTails": [
    1,
    6,
    3,
    4,
    2,
    7,
    8
  ],
  "pools": {
    "3": [
      "鸡",
      "鼠",
      "猴"
    ],
    "4": [
      "鸡",
      "鼠",
      "猴",
      "牛"
    ],
    "5": [
      "鸡",
      "鼠",
      "猴",
      "牛",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};