var ensembleData = {
  "time": "2026-07-07 21:32:32",
  "issue": "2026188",
  "code": "38,05,19,10,14,01,16",
  "zodiac": "蛇,虎,鼠,鸡,蛇,马,兔",
  "wave": "green,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026189",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "鼠",
    "马",
    "猪",
    "狗",
    "猴",
    "羊"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "牛",
    "鼠",
    "马",
    "猪"
  ],
  "killZodiacs": [
    "猪",
    "兔"
  ],
  "numbers": [
    2,
    38,
    6,
    7,
    42,
    43,
    14,
    18,
    19,
    26,
    30,
    31,
    25,
    34,
    8,
    37
  ],
  "optTails": [
    1,
    6,
    4,
    5,
    9,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "牛",
      "鼠"
    ],
    "4": [
      "蛇",
      "鸡",
      "牛",
      "鼠"
    ],
    "5": [
      "蛇",
      "鸡",
      "牛",
      "鼠",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};