var ensembleData = {
  "time": "2026-06-22 21:32:32",
  "issue": "2026173",
  "code": "39,06,16,40,13,19,26",
  "zodiac": "龙,牛,兔,兔,马,鼠,蛇",
  "wave": "green,green,green,red,red,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026174",
  "ninePool": [
    "猴",
    "牛",
    "鼠",
    "鸡",
    "虎",
    "马",
    "兔",
    "猪",
    "羊"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "牛",
    "鸡",
    "虎",
    "马"
  ],
  "killZodiacs": [
    "狗",
    "蛇"
  ],
  "numbers": [
    47,
    18,
    35,
    11,
    30,
    31,
    7,
    23,
    25,
    10,
    17,
    5,
    41,
    1,
    37,
    46
  ],
  "optTails": [
    0,
    1,
    5,
    7,
    8,
    3,
    6
  ],
  "pools": {
    "3": [
      "猴",
      "牛",
      "鼠"
    ],
    "4": [
      "猴",
      "鼠",
      "牛",
      "鸡"
    ],
    "5": [
      "猴",
      "鼠",
      "牛",
      "鸡",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};