var ensembleData = {
  "time": "2026-09-19 21:32:32",
  "issue": "2026262",
  "code": "38,22,33,47,36,07,30",
  "zodiac": "蛇,鸡,狗,猴,羊,鼠,牛",
  "wave": "green,green,green,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026263",
  "ninePool": [
    "虎",
    "猪",
    "兔",
    "狗",
    "猴",
    "鸡",
    "牛",
    "鼠",
    "羊"
  ],
  "sixPool": [
    "虎",
    "猪",
    "兔",
    "狗",
    "猴",
    "鸡"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    32,
    4,
    5,
    40,
    41,
    8,
    44,
    16,
    17,
    20,
    28,
    29,
    33,
    10,
    9,
    23
  ],
  "optTails": [
    0,
    2,
    4,
    6,
    3,
    8,
    9
  ],
  "pools": {
    "3": [
      "虎",
      "兔",
      "猪"
    ],
    "4": [
      "虎",
      "猪",
      "兔",
      "狗"
    ],
    "5": [
      "虎",
      "猪",
      "兔",
      "狗",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};