var ensembleData = {
  "time": "2026-08-20 21:32:32",
  "issue": "2026232",
  "code": "29,10,17,04,46,20,42",
  "zodiac": "虎,鸡,虎,兔,鸡,猪,牛",
  "wave": "red,blue,green,blue,red,blue,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026233",
  "ninePool": [
    "猪",
    "狗",
    "虎",
    "鼠",
    "龙",
    "鸡",
    "马",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "狗",
    "虎",
    "鼠",
    "龙",
    "鸡"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    32,
    33,
    5,
    8,
    9,
    41,
    44,
    45,
    17,
    20,
    21,
    29,
    34,
    22,
    10,
    46
  ],
  "optTails": [
    3,
    6,
    0,
    2,
    8,
    9,
    4
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "猪"
    ],
    "4": [
      "猪",
      "狗",
      "虎",
      "鼠"
    ],
    "5": [
      "猪",
      "狗",
      "虎",
      "鼠",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};