var ensembleData = {
  "time": "2026-06-21 21:32:32",
  "issue": "2026172",
  "code": "28,34,42,37,45,08,44",
  "zodiac": "兔,鸡,牛,马,狗,猪,猪",
  "wave": "green,red,blue,blue,red,red,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026173",
  "ninePool": [
    "虎",
    "牛",
    "马",
    "鸡",
    "羊",
    "鼠",
    "猴",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "虎",
    "牛",
    "马",
    "鸡",
    "羊",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    18,
    30,
    42,
    6,
    29,
    13,
    10,
    36,
    12,
    22,
    46,
    48,
    34,
    43,
    19,
    24
  ],
  "optTails": [
    0,
    2,
    6,
    8,
    3,
    4,
    9
  ],
  "pools": {
    "3": [
      "虎",
      "牛",
      "马"
    ],
    "4": [
      "虎",
      "牛",
      "马",
      "鸡"
    ],
    "5": [
      "虎",
      "牛",
      "马",
      "鸡",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};