var ensembleData = {
  "time": "2026-10-05 21:32:32",
  "issue": "2026278",
  "code": "06,40,24,29,44,01,02",
  "zodiac": "牛,兔,羊,虎,猪,马,蛇",
  "wave": "green,red,red,red,green,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026279",
  "ninePool": [
    "龙",
    "牛",
    "虎",
    "兔",
    "狗",
    "猴",
    "羊",
    "猪",
    "马"
  ],
  "sixPool": [
    "龙",
    "牛",
    "虎",
    "兔",
    "狗",
    "猴"
  ],
  "killZodiacs": [
    "鼠",
    "蛇"
  ],
  "numbers": [
    3,
    5,
    6,
    39,
    41,
    42,
    15,
    17,
    18,
    27,
    29,
    30,
    28,
    4,
    23,
    16
  ],
  "optTails": [
    2,
    1,
    3,
    4,
    0,
    6,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "牛",
      "虎"
    ],
    "4": [
      "龙",
      "牛",
      "虎",
      "兔"
    ],
    "5": [
      "龙",
      "牛",
      "虎",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};