var ensembleData = {
  "time": "2026-07-05 21:32:32",
  "issue": "2026186",
  "code": "17,29,22,01,05,38,23",
  "zodiac": "虎,虎,鸡,马,虎,蛇,猴",
  "wave": "green,red,green,red,green,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026187",
  "ninePool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "牛",
    "虎",
    "羊",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    38,
    25,
    17,
    5
  ],
  "optTails": [
    1,
    4,
    5,
    6,
    8,
    9,
    7
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "牛"
    ],
    "4": [
      "龙",
      "兔",
      "马",
      "蛇"
    ],
    "5": [
      "龙",
      "兔",
      "马",
      "蛇",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};