var ensembleData = {
  "time": "2026-09-27 21:32:32",
  "issue": "2026270",
  "code": "39,34,20,24,17,06,19",
  "zodiac": "龙,鸡,猪,羊,虎,牛,鼠",
  "wave": "green,red,blue,red,green,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026271",
  "ninePool": [
    "虎",
    "龙",
    "狗",
    "蛇",
    "兔",
    "牛",
    "马",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "龙",
    "虎",
    "狗",
    "蛇",
    "兔",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "numbers": [
    33,
    3,
    5,
    39,
    9,
    41,
    45,
    15,
    17,
    21,
    27,
    29,
    6,
    4,
    26,
    42
  ],
  "optTails": [
    0,
    9,
    2,
    4,
    8,
    3,
    6
  ],
  "pools": {
    "3": [
      "龙",
      "狗",
      "虎"
    ],
    "4": [
      "龙",
      "虎",
      "狗",
      "蛇"
    ],
    "5": [
      "龙",
      "虎",
      "狗",
      "蛇",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};