var ensembleData = {
  "time": "2026-10-02 21:32:32",
  "issue": "2026275",
  "code": "42,49,04,47,14,43,17",
  "zodiac": "牛,马,兔,猴,蛇,鼠,虎",
  "wave": "blue,green,blue,blue,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026276",
  "ninePool": [
    "蛇",
    "狗",
    "羊",
    "猪",
    "猴",
    "马",
    "鸡",
    "龙",
    "鼠"
  ],
  "sixPool": [
    "蛇",
    "狗",
    "羊",
    "猪",
    "猴",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "虎"
  ],
  "numbers": [
    33,
    2,
    36,
    38,
    9,
    12,
    45,
    14,
    48,
    21,
    24,
    26,
    34,
    47,
    11,
    23
  ],
  "optTails": [
    0,
    2,
    3,
    7,
    8,
    1,
    4
  ],
  "pools": {
    "3": [
      "蛇",
      "狗",
      "羊"
    ],
    "4": [
      "蛇",
      "狗",
      "羊",
      "猪"
    ],
    "5": [
      "蛇",
      "狗",
      "羊",
      "猪",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};