var ensembleData = {
  "time": "2026-08-30 21:32:32",
  "issue": "2026242",
  "code": "29,35,46,32,13,31,09",
  "zodiac": "虎,猴,鸡,猪,马,鼠,狗",
  "wave": "red,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026243",
  "ninePool": [
    "鼠",
    "虎",
    "龙",
    "鸡",
    "猴",
    "羊",
    "狗",
    "蛇",
    "马"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "龙",
    "鸡",
    "猴",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "狗"
  ],
  "numbers": [
    3,
    5,
    7,
    39,
    41,
    43,
    15,
    17,
    19,
    27,
    29,
    31,
    34,
    46,
    24,
    36
  ],
  "optTails": [
    9,
    2,
    1,
    5,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "鼠",
      "虎",
      "龙"
    ],
    "4": [
      "鼠",
      "虎",
      "龙",
      "鸡"
    ],
    "5": [
      "鼠",
      "虎",
      "龙",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};