var ensembleData = {
  "time": "2026-06-23 21:32:32",
  "issue": "2026174",
  "code": "15,08,34,13,28,21,41",
  "zodiac": "龙,猪,鸡,马,兔,狗,虎",
  "wave": "blue,red,red,red,green,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026175",
  "ninePool": [
    "马",
    "蛇",
    "鸡",
    "狗",
    "龙",
    "猪",
    "兔",
    "猴",
    "牛"
  ],
  "sixPool": [
    "马",
    "蛇",
    "鸡",
    "狗",
    "龙",
    "猪"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "numbers": [
    38,
    25,
    45,
    1,
    37,
    21,
    14,
    33,
    13,
    27,
    8,
    15,
    34,
    46,
    3,
    44
  ],
  "optTails": [
    1,
    5,
    7,
    8,
    3,
    4,
    6
  ],
  "pools": {
    "3": [
      "马",
      "蛇",
      "狗"
    ],
    "4": [
      "马",
      "蛇",
      "鸡",
      "狗"
    ],
    "5": [
      "马",
      "蛇",
      "鸡",
      "狗",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};