var ensembleData = {
  "time": "2026-07-24 21:32:32",
  "issue": "2026205",
  "code": "30,17,39,12,11,28,03",
  "zodiac": "牛,虎,龙,羊,猴,兔,龙",
  "wave": "red,green,green,red,green,green,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026206",
  "ninePool": [
    "猴",
    "兔",
    "牛",
    "鸡",
    "虎",
    "狗",
    "羊",
    "鼠",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "兔",
    "牛",
    "鸡",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "龙"
  ],
  "numbers": [
    35,
    4,
    5,
    40,
    41,
    11,
    47,
    16,
    17,
    23,
    28,
    29,
    34,
    46,
    6,
    24
  ],
  "optTails": [
    5,
    9,
    6,
    7,
    8,
    1,
    4
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "虎"
    ],
    "4": [
      "猴",
      "兔",
      "牛",
      "鸡"
    ],
    "5": [
      "猴",
      "兔",
      "牛",
      "鸡",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};