var ensembleData = {
  "time": "2026-07-01 21:32:32",
  "issue": "2026182",
  "code": "15,23,09,45,24,39,41",
  "zodiac": "龙,猴,狗,狗,羊,龙,虎",
  "wave": "blue,red,blue,red,red,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026183",
  "ninePool": [
    "兔",
    "狗",
    "牛",
    "鼠",
    "猴",
    "猪",
    "马",
    "羊",
    "鸡"
  ],
  "sixPool": [
    "兔",
    "狗",
    "牛",
    "鼠",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "numbers": [
    33,
    4,
    6,
    40,
    9,
    42,
    45,
    16,
    18,
    21,
    28,
    30,
    35,
    8,
    32,
    44
  ],
  "optTails": [
    1,
    6,
    4,
    5,
    8,
    9,
    2
  ],
  "pools": {
    "3": [
      "兔",
      "狗",
      "牛"
    ],
    "4": [
      "兔",
      "狗",
      "牛",
      "鼠"
    ],
    "5": [
      "兔",
      "狗",
      "牛",
      "鼠",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};