var ensembleData = {
  "time": "2026-07-19 21:32:32",
  "issue": "2026200",
  "code": "43,46,05,32,35,29,39",
  "zodiac": "鼠,鸡,虎,猪,猴,虎,龙",
  "wave": "green,red,green,green,red,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026201",
  "ninePool": [
    "猴",
    "鼠",
    "虎",
    "兔",
    "羊",
    "鸡",
    "牛",
    "狗",
    "马"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "虎",
    "羊",
    "兔",
    "鸡"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    35,
    36,
    7,
    43,
    12,
    11,
    47,
    48,
    19,
    23,
    24,
    31,
    34,
    4,
    22,
    40
  ],
  "optTails": [
    9,
    6,
    8,
    0,
    2,
    3,
    4
  ],
  "pools": {
    "3": [
      "鼠",
      "羊",
      "猴"
    ],
    "4": [
      "猴",
      "鼠",
      "虎",
      "羊"
    ],
    "5": [
      "猴",
      "鼠",
      "虎",
      "羊",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};