var ensembleData = {
  "time": "2026-10-23 21:32:32",
  "issue": "2026296",
  "code": "14,43,26,45,03,31,23",
  "zodiac": "蛇,鼠,蛇,狗,龙,鼠,猴",
  "wave": "blue,green,blue,red,blue,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026297",
  "ninePool": [
    "羊",
    "狗",
    "鼠",
    "猪",
    "龙",
    "蛇",
    "鸡",
    "牛",
    "兔"
  ],
  "sixPool": [
    "羊",
    "狗",
    "鼠",
    "猪",
    "蛇",
    "龙"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    2,
    36,
    38,
    7,
    43,
    12,
    14,
    48,
    19,
    24,
    26,
    31,
    3,
    39,
    44,
    20
  ],
  "optTails": [
    0,
    3,
    6,
    7,
    1,
    4,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "鼠",
      "蛇"
    ],
    "4": [
      "羊",
      "狗",
      "鼠",
      "猪"
    ],
    "5": [
      "羊",
      "狗",
      "鼠",
      "猪",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};