var ensembleData = {
  "time": "2026-10-04 21:32:32",
  "issue": "2026277",
  "code": "41,23,14,31,13,32,11",
  "zodiac": "虎,猴,蛇,鼠,马,猪,猴",
  "wave": "blue,red,blue,blue,red,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026278",
  "ninePool": [
    "猪",
    "牛",
    "羊",
    "狗",
    "鼠",
    "猴",
    "虎",
    "龙",
    "马"
  ],
  "sixPool": [
    "猪",
    "牛",
    "羊",
    "狗",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "numbers": [
    32,
    36,
    6,
    8,
    42,
    12,
    44,
    48,
    18,
    20,
    24,
    30,
    31,
    21,
    11,
    45
  ],
  "optTails": [
    2,
    5,
    1,
    4,
    9,
    6,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "牛",
      "猪"
    ],
    "4": [
      "猪",
      "牛",
      "羊",
      "狗"
    ],
    "5": [
      "猪",
      "牛",
      "羊",
      "狗",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};