var ensembleData = {
  "time": "2026-08-14 21:32:32",
  "issue": "2026226",
  "code": "01,11,29,38,04,33,17",
  "zodiac": "马,猴,虎,蛇,兔,狗,虎",
  "wave": "red,green,red,green,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026227",
  "ninePool": [
    "龙",
    "鸡",
    "兔",
    "蛇",
    "狗",
    "马",
    "猴",
    "猪",
    "羊"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "兔",
    "蛇",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "numbers": [
    33,
    3,
    4,
    39,
    40,
    9,
    45,
    15,
    16,
    21,
    27,
    28,
    38,
    34,
    22,
    2
  ],
  "optTails": [
    1,
    6,
    8,
    9,
    2,
    4,
    5
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "狗"
    ],
    "4": [
      "龙",
      "鸡",
      "兔",
      "蛇"
    ],
    "5": [
      "龙",
      "鸡",
      "兔",
      "蛇",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};