var ensembleData = {
  "time": "2026-08-04 21:32:32",
  "issue": "2026216",
  "code": "18,41,32,44,36,45,37",
  "zodiac": "牛,虎,猪,猪,羊,狗,马",
  "wave": "red,blue,green,green,blue,red,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026217",
  "ninePool": [
    "狗",
    "鸡",
    "羊",
    "猴",
    "猪",
    "龙",
    "兔",
    "虎",
    "鼠"
  ],
  "sixPool": [
    "狗",
    "羊",
    "鸡",
    "猴",
    "猪",
    "龙"
  ],
  "killZodiacs": [
    "猪",
    "马"
  ],
  "numbers": [
    33,
    34,
    36,
    9,
    10,
    12,
    45,
    46,
    48,
    21,
    22,
    24,
    27,
    15,
    47,
    8
  ],
  "optTails": [
    1,
    4,
    9,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "狗"
    ],
    "4": [
      "狗",
      "羊",
      "鸡",
      "猴"
    ],
    "5": [
      "狗",
      "羊",
      "鸡",
      "猴",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};