var ensembleData = {
  "time": "2026-10-16 21:32:32",
  "issue": "2026289",
  "code": "12,29,19,28,47,34,38",
  "zodiac": "羊,虎,鼠,兔,猴,鸡,蛇",
  "wave": "red,red,red,green,blue,red,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026290",
  "ninePool": [
    "虎",
    "鼠",
    "狗",
    "兔",
    "鸡",
    "牛",
    "猴",
    "猪",
    "马"
  ],
  "sixPool": [
    "虎",
    "鼠",
    "狗",
    "兔",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "numbers": [
    33,
    5,
    7,
    9,
    41,
    43,
    45,
    17,
    19,
    21,
    29,
    31,
    34,
    6,
    4,
    16
  ],
  "optTails": [
    8,
    5,
    4,
    9,
    1,
    6,
    7
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "鼠"
    ],
    "4": [
      "虎",
      "鼠",
      "狗",
      "兔"
    ],
    "5": [
      "虎",
      "鼠",
      "狗",
      "兔",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};