var ensembleData = {
  "time": "2026-08-05 21:32:32",
  "issue": "2026217",
  "code": "34,12,11,30,42,07,26",
  "zodiac": "鸡,羊,猴,牛,牛,鼠,蛇",
  "wave": "red,red,green,red,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026218",
  "ninePool": [
    "猴",
    "鸡",
    "牛",
    "羊",
    "虎",
    "鼠",
    "狗",
    "龙",
    "兔"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "牛",
    "羊",
    "虎",
    "鼠"
  ],
  "killZodiacs": [
    "龙",
    "蛇"
  ],
  "numbers": [
    34,
    35,
    6,
    42,
    11,
    10,
    46,
    47,
    18,
    22,
    23,
    30,
    17,
    12,
    43,
    48
  ],
  "optTails": [
    4,
    6,
    1,
    7,
    8,
    2,
    3
  ],
  "pools": {
    "3": [
      "猴",
      "牛",
      "鸡"
    ],
    "4": [
      "猴",
      "鸡",
      "牛",
      "羊"
    ],
    "5": [
      "猴",
      "鸡",
      "牛",
      "羊",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};