var ensembleData = {
  "time": "2026-10-19 21:32:32",
  "issue": "2026292",
  "code": "39,10,18,23,16,04,36",
  "zodiac": "龙,鸡,牛,猴,兔,兔,羊",
  "wave": "green,blue,red,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026293",
  "ninePool": [
    "牛",
    "兔",
    "猴",
    "鼠",
    "龙",
    "蛇",
    "鸡",
    "羊",
    "猪"
  ],
  "sixPool": [
    "牛",
    "兔",
    "猴",
    "鼠",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "羊"
  ],
  "numbers": [
    35,
    4,
    6,
    40,
    42,
    11,
    47,
    16,
    18,
    23,
    28,
    30,
    3,
    43,
    26,
    14
  ],
  "optTails": [
    8,
    0,
    2,
    4,
    6,
    9,
    3
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "兔"
    ],
    "4": [
      "牛",
      "兔",
      "猴",
      "鼠"
    ],
    "5": [
      "牛",
      "兔",
      "猴",
      "鼠",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};