var ensembleData = {
  "time": "2026-06-26 21:32:32",
  "issue": "2026177",
  "code": "19,21,05,01,02,44,14",
  "zodiac": "鼠,狗,虎,马,蛇,猪,蛇",
  "wave": "red,green,green,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026178",
  "ninePool": [
    "牛",
    "猴",
    "虎",
    "鼠",
    "羊",
    "猪",
    "狗",
    "马",
    "龙"
  ],
  "sixPool": [
    "牛",
    "猴",
    "虎",
    "鼠",
    "羊",
    "猪"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    35,
    36,
    6,
    42,
    11,
    12,
    47,
    48,
    18,
    23,
    24,
    30,
    17,
    20,
    43,
    5
  ],
  "optTails": [
    6,
    0,
    1,
    3,
    5,
    2,
    7
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "羊"
    ],
    "4": [
      "牛",
      "猴",
      "虎",
      "鼠"
    ],
    "5": [
      "牛",
      "猴",
      "虎",
      "鼠",
      "羊"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};