var ensembleData = {
  "time": "2026-10-12 21:32:32",
  "issue": "2026285",
  "code": "46,45,43,39,20,40,19",
  "zodiac": "鸡,狗,鼠,龙,猪,兔,鼠",
  "wave": "red,red,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026286",
  "ninePool": [
    "马",
    "兔",
    "狗",
    "牛",
    "龙",
    "蛇",
    "鸡",
    "猴",
    "虎"
  ],
  "sixPool": [
    "马",
    "兔",
    "狗",
    "牛",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "羊",
    "鼠"
  ],
  "numbers": [
    1,
    4,
    37,
    6,
    40,
    42,
    13,
    16,
    18,
    25,
    28,
    30,
    45,
    3,
    26,
    27
  ],
  "optTails": [
    0,
    2,
    1,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "兔"
    ],
    "4": [
      "马",
      "兔",
      "狗",
      "牛"
    ],
    "5": [
      "马",
      "兔",
      "狗",
      "牛",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};