var ensembleData = {
  "time": "2026-08-13 21:32:32",
  "issue": "2026225",
  "code": "07,34,27,10,19,38,01",
  "zodiac": "鼠,鸡,龙,鸡,鼠,蛇,马",
  "wave": "red,red,green,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026226",
  "ninePool": [
    "龙",
    "虎",
    "牛",
    "鸡",
    "鼠",
    "羊",
    "狗",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "虎",
    "牛",
    "鸡",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "numbers": [
    34,
    3,
    5,
    39,
    41,
    10,
    46,
    15,
    17,
    22,
    27,
    29,
    12,
    30,
    42,
    18
  ],
  "optTails": [
    3,
    6,
    8,
    9,
    0,
    2,
    4
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "鸡"
    ],
    "4": [
      "龙",
      "虎",
      "牛",
      "鸡"
    ],
    "5": [
      "龙",
      "虎",
      "牛",
      "鸡",
      "鼠"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};