var ensembleData = {
  "time": "2026-09-21 21:32:32",
  "issue": "2026264",
  "code": "10,06,08,31,22,24,21",
  "zodiac": "鸡,牛,猪,鼠,鸡,羊,狗",
  "wave": "blue,green,red,blue,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026265",
  "ninePool": [
    "兔",
    "鸡",
    "猪",
    "龙",
    "鼠",
    "羊",
    "猴",
    "马",
    "虎"
  ],
  "sixPool": [
    "兔",
    "鸡",
    "猪",
    "龙",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "狗",
    "狗"
  ],
  "numbers": [
    32,
    34,
    4,
    40,
    8,
    10,
    44,
    46,
    16,
    20,
    22,
    28,
    15,
    36,
    3,
    43
  ],
  "optTails": [
    0,
    1,
    6,
    7,
    3,
    5,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "鸡",
      "猪"
    ],
    "4": [
      "兔",
      "鸡",
      "猪",
      "龙"
    ],
    "5": [
      "兔",
      "鸡",
      "猪",
      "龙",
      "鼠"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};