var ensembleData = {
  "time": "2026-06-20 21:32:32",
  "issue": "2026171",
  "code": "24,38,40,31,42,46,28",
  "zodiac": "",
  "wave": "",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026172",
  "ninePool": [
    "猴",
    "鼠",
    "蛇",
    "猪",
    "龙",
    "虎",
    "牛",
    "马",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "龙",
    "猪",
    "蛇",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "numbers": [
    14,
    26,
    44,
    42,
    2,
    32,
    6,
    38,
    18,
    47,
    11,
    27,
    31,
    7,
    23,
    43
  ],
  "optTails": [
    1,
    2,
    4,
    6,
    7,
    3,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "猪",
      "牛"
    ],
    "4": [
      "猴",
      "鼠",
      "龙",
      "猪"
    ],
    "5": [
      "猴",
      "鼠",
      "龙",
      "猪",
      "蛇"
    ]
  },
  "dynamicRate9": 0,
  "dynamicRate6": 0
};