var ensembleData = {
  "time": "2026-08-09 21:32:32",
  "issue": "2026221",
  "code": "24,14,18,48,46,28,01",
  "zodiac": "羊,蛇,牛,羊,鸡,兔,马",
  "wave": "red,blue,red,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026222",
  "ninePool": [
    "龙",
    "虎",
    "狗",
    "羊",
    "牛",
    "猪",
    "鼠",
    "鸡",
    "兔"
  ],
  "sixPool": [
    "龙",
    "虎",
    "狗",
    "羊",
    "牛",
    "猪"
  ],
  "killZodiacs": [
    "虎",
    "马"
  ],
  "numbers": [
    3,
    36,
    5,
    39,
    41,
    12,
    15,
    48,
    17,
    24,
    27,
    29,
    33,
    42,
    18,
    21
  ],
  "optTails": [
    4,
    6,
    7,
    1,
    3,
    8,
    2
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "羊"
    ],
    "4": [
      "龙",
      "虎",
      "狗",
      "羊"
    ],
    "5": [
      "龙",
      "虎",
      "狗",
      "羊",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};