var ensembleData = {
  "time": "2026-07-28 21:32:32",
  "issue": "2026209",
  "code": "44,05,39,14,21,22,08",
  "zodiac": "猪,虎,龙,蛇,狗,鸡,猪",
  "wave": "green,green,green,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026210",
  "ninePool": [
    "兔",
    "龙",
    "蛇",
    "牛",
    "鸡",
    "马",
    "虎",
    "狗",
    "羊"
  ],
  "sixPool": [
    "兔",
    "龙",
    "蛇",
    "牛",
    "马",
    "鸡"
  ],
  "killZodiacs": [
    "猪",
    "猪"
  ],
  "numbers": [
    2,
    3,
    4,
    38,
    39,
    40,
    14,
    15,
    16,
    26,
    27,
    28,
    34,
    46,
    37,
    6
  ],
  "optTails": [
    5,
    9,
    1,
    7,
    8,
    4,
    6
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "蛇"
    ],
    "4": [
      "兔",
      "龙",
      "蛇",
      "牛"
    ],
    "5": [
      "兔",
      "龙",
      "蛇",
      "牛",
      "马"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};