var ensembleData = {
  "time": "2026-07-21 21:32:32",
  "issue": "2026202",
  "code": "21,15,25,47,13,45,40",
  "zodiac": "狗,龙,马,猴,马,狗,兔",
  "wave": "green,blue,blue,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026203",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "狗",
    "猪",
    "鼠",
    "蛇",
    "兔",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "狗",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "牛",
    "兔"
  ],
  "numbers": [
    34,
    35,
    36,
    10,
    11,
    12,
    46,
    47,
    48,
    22,
    23,
    24,
    20,
    33,
    43,
    31
  ],
  "optTails": [
    6,
    0,
    2,
    5,
    1,
    3,
    4
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "猴"
    ],
    "4": [
      "鸡",
      "羊",
      "猴",
      "狗"
    ],
    "5": [
      "鸡",
      "羊",
      "猴",
      "狗",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};