var ensembleData = {
  "time": "2026-06-25 21:32:32",
  "issue": "2026176",
  "code": "30,31,02,36,38,15,10",
  "zodiac": "牛,鼠,蛇,羊,蛇,龙,鸡",
  "wave": "red,blue,red,blue,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026177",
  "ninePool": [
    "猴",
    "马",
    "羊",
    "龙",
    "牛",
    "虎",
    "狗",
    "蛇",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "马",
    "羊",
    "龙",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "numbers": [
    3,
    36,
    35,
    39,
    11,
    12,
    15,
    48,
    47,
    23,
    24,
    27,
    17,
    30,
    13,
    1
  ],
  "optTails": [
    4,
    6,
    0,
    1,
    3,
    9,
    7
  ],
  "pools": {
    "3": [
      "羊",
      "龙",
      "猴"
    ],
    "4": [
      "猴",
      "马",
      "羊",
      "龙"
    ],
    "5": [
      "猴",
      "马",
      "羊",
      "龙",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};