var ensembleData = {
  "time": "2026-06-28 21:32:32",
  "issue": "2026179",
  "code": "10,11,26,06,31,09,15",
  "zodiac": "鸡,猴,蛇,牛,鼠,狗,龙",
  "wave": "blue,green,blue,green,blue,blue,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026180",
  "ninePool": [
    "鼠",
    "猴",
    "马",
    "兔",
    "龙",
    "羊",
    "虎",
    "狗",
    "牛"
  ],
  "sixPool": [
    "鼠",
    "猴",
    "马",
    "兔",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "numbers": [
    35,
    3,
    7,
    39,
    11,
    43,
    47,
    15,
    19,
    23,
    27,
    31,
    25,
    12,
    1,
    36
  ],
  "optTails": [
    4,
    6,
    8,
    1,
    5,
    2,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "鼠",
      "龙"
    ],
    "4": [
      "鼠",
      "猴",
      "马",
      "兔"
    ],
    "5": [
      "鼠",
      "猴",
      "马",
      "兔",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};