var ensembleData = {
  "time": "2026-10-28 21:32:32",
  "issue": "2026301",
  "code": "27,41,23,11,02,43,17",
  "zodiac": "龙,虎,猴,猴,蛇,鼠,虎",
  "wave": "green,blue,red,green,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026302",
  "ninePool": [
    "狗",
    "鸡",
    "龙",
    "蛇",
    "羊",
    "兔",
    "猴",
    "鼠",
    "马"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "龙",
    "蛇",
    "兔",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "虎"
  ],
  "numbers": [
    33,
    34,
    3,
    39,
    9,
    10,
    45,
    46,
    15,
    21,
    22,
    27,
    4,
    26,
    16,
    14
  ],
  "optTails": [
    8,
    5,
    6,
    7,
    1,
    4,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "龙"
    ],
    "4": [
      "狗",
      "鸡",
      "龙",
      "蛇"
    ],
    "5": [
      "狗",
      "鸡",
      "龙",
      "蛇",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};