var ensembleData = {
  "time": "2026-09-23 21:32:32",
  "issue": "2026266",
  "code": "38,42,37,29,45,18,08",
  "zodiac": "蛇,牛,马,虎,狗,牛,猪",
  "wave": "green,blue,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026267",
  "ninePool": [
    "兔",
    "蛇",
    "虎",
    "龙",
    "羊",
    "猴",
    "牛",
    "鼠",
    "鸡"
  ],
  "sixPool": [
    "兔",
    "蛇",
    "虎",
    "羊",
    "龙",
    "猴"
  ],
  "killZodiacs": [
    "狗",
    "猪"
  ],
  "numbers": [
    2,
    4,
    36,
    38,
    40,
    12,
    14,
    16,
    48,
    24,
    26,
    28,
    41,
    15,
    3,
    47
  ],
  "optTails": [
    0,
    1,
    6,
    7,
    8,
    3,
    5
  ],
  "pools": {
    "3": [
      "蛇",
      "兔",
      "羊"
    ],
    "4": [
      "兔",
      "蛇",
      "虎",
      "羊"
    ],
    "5": [
      "兔",
      "蛇",
      "虎",
      "羊",
      "龙"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};