var ensembleData = {
  "time": "2026-09-20 21:32:32",
  "issue": "2026263",
  "code": "44,28,03,02,24,13,09",
  "zodiac": "猪,兔,龙,蛇,羊,马,狗",
  "wave": "green,green,blue,red,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026264",
  "ninePool": [
    "虎",
    "蛇",
    "狗",
    "猴",
    "牛",
    "猪",
    "鼠",
    "龙",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "蛇",
    "狗",
    "牛",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "numbers": [
    33,
    2,
    5,
    38,
    9,
    41,
    45,
    14,
    17,
    21,
    26,
    29,
    8,
    6,
    11,
    18
  ],
  "optTails": [
    0,
    2,
    4,
    1,
    6,
    3,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "狗",
      "蛇"
    ],
    "4": [
      "虎",
      "蛇",
      "狗",
      "牛"
    ],
    "5": [
      "虎",
      "蛇",
      "狗",
      "牛",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};