var ensembleData = {
  "time": "2026-08-25 21:32:32",
  "issue": "2026237",
  "code": "47,36,14,06,41,25,12",
  "zodiac": "猴,羊,蛇,牛,虎,马,羊",
  "wave": "blue,blue,blue,green,blue,blue,red",
  "teSx": "羊",
  "teWei": 2,
  "nextIssue": "2026238",
  "ninePool": [
    "龙",
    "鸡",
    "兔",
    "马",
    "猴",
    "狗",
    "猪",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "兔",
    "马",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    33,
    34,
    3,
    39,
    9,
    10,
    45,
    46,
    15,
    21,
    22,
    27,
    13,
    47,
    4,
    37
  ],
  "optTails": [
    2,
    1,
    3,
    6,
    7,
    8,
    4
  ],
  "pools": {
    "3": [
      "龙",
      "鸡",
      "狗"
    ],
    "4": [
      "龙",
      "鸡",
      "兔",
      "马"
    ],
    "5": [
      "龙",
      "鸡",
      "兔",
      "马",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};