var ensembleData = {
  "time": "2026-09-09 21:32:32",
  "issue": "2026252",
  "code": "33,41,43,13,06,48,22",
  "zodiac": "狗,虎,鼠,马,牛,羊,鸡",
  "wave": "green,blue,green,red,green,blue,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026253",
  "ninePool": [
    "龙",
    "羊",
    "兔",
    "牛",
    "虎",
    "狗",
    "鼠",
    "蛇",
    "马"
  ],
  "sixPool": [
    "龙",
    "羊",
    "兔",
    "牛",
    "虎",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "鸡"
  ],
  "numbers": [
    3,
    4,
    36,
    39,
    40,
    12,
    15,
    48,
    16,
    24,
    27,
    28,
    45,
    41,
    29,
    17
  ],
  "optTails": [
    1,
    4,
    6,
    8,
    5,
    7,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "兔",
      "龙"
    ],
    "4": [
      "龙",
      "羊",
      "兔",
      "牛"
    ],
    "5": [
      "龙",
      "羊",
      "兔",
      "牛",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};