var ensembleData = {
  "time": "2026-06-29 21:32:32",
  "issue": "2026180",
  "code": "14,10,37,30,49,19,21",
  "zodiac": "蛇,鸡,马,牛,马,鼠,狗",
  "wave": "blue,blue,blue,red,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026181",
  "ninePool": [
    "猴",
    "羊",
    "鼠",
    "马",
    "牛",
    "兔",
    "猪",
    "鸡",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "羊",
    "鼠",
    "马",
    "牛",
    "兔"
  ],
  "killZodiacs": [
    "马",
    "狗"
  ],
  "numbers": [
    35,
    36,
    6,
    42,
    11,
    12,
    47,
    48,
    18,
    23,
    24,
    30,
    43,
    13,
    40,
    19
  ],
  "optTails": [
    4,
    6,
    8,
    0,
    2,
    3,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "牛"
    ],
    "4": [
      "猴",
      "羊",
      "鼠",
      "马"
    ],
    "5": [
      "猴",
      "羊",
      "鼠",
      "马",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};