var ensembleData = {
  "time": "2026-08-29 21:32:32",
  "issue": "2026241",
  "code": "29,45,27,21,42,41,49",
  "zodiac": "虎,狗,龙,狗,牛,虎,马",
  "wave": "red,red,green,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026242",
  "ninePool": [
    "虎",
    "猴",
    "龙",
    "狗",
    "兔",
    "牛",
    "鸡",
    "猪",
    "羊"
  ],
  "sixPool": [
    "虎",
    "猴",
    "龙",
    "狗",
    "兔",
    "牛"
  ],
  "killZodiacs": [
    "羊",
    "马"
  ],
  "numbers": [
    35,
    3,
    5,
    39,
    41,
    11,
    47,
    15,
    17,
    23,
    27,
    29,
    30,
    33,
    45,
    21
  ],
  "optTails": [
    2,
    7,
    1,
    5,
    0,
    3,
    6
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "龙"
    ],
    "4": [
      "虎",
      "猴",
      "龙",
      "狗"
    ],
    "5": [
      "虎",
      "猴",
      "龙",
      "狗",
      "兔"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};