var ensembleData = {
  "time": "2026-07-25 21:32:32",
  "issue": "2026206",
  "code": "09,49,37,03,40,35,47",
  "zodiac": "狗,马,马,龙,兔,猴,猴",
  "wave": "blue,green,blue,blue,red,red,blue",
  "teSx": "猴",
  "teWei": 7,
  "nextIssue": "2026207",
  "ninePool": [
    "兔",
    "牛",
    "龙",
    "蛇",
    "狗",
    "马",
    "猪",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "兔",
    "牛",
    "龙",
    "蛇",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "猴"
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    38,
    33,
    13,
    2
  ],
  "optTails": [
    7,
    0,
    2,
    3,
    8,
    1,
    4
  ],
  "pools": {
    "3": [
      "兔",
      "牛",
      "龙"
    ],
    "4": [
      "兔",
      "牛",
      "龙",
      "蛇"
    ],
    "5": [
      "兔",
      "牛",
      "龙",
      "蛇",
      "狗"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};