var ensembleData = {
  "time": "2026-10-21 21:32:32",
  "issue": "2026294",
  "code": "29,43,10,02,34,27,28",
  "zodiac": "虎,鼠,鸡,蛇,鸡,龙,兔",
  "wave": "red,green,blue,red,red,green,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026295",
  "ninePool": [
    "牛",
    "鼠",
    "狗",
    "马",
    "虎",
    "蛇",
    "羊",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "牛",
    "鼠",
    "狗",
    "马",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "鸡",
    "兔"
  ],
  "numbers": [
    1,
    37,
    6,
    7,
    42,
    43,
    13,
    18,
    19,
    25,
    30,
    31,
    41,
    21,
    33,
    24
  ],
  "optTails": [
    0,
    4,
    6,
    7,
    9,
    1,
    3
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "马"
    ],
    "4": [
      "牛",
      "鼠",
      "狗",
      "马"
    ],
    "5": [
      "牛",
      "鼠",
      "狗",
      "马",
      "虎"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};