var ensembleData = {
  "time": "2026-09-05 21:32:32",
  "issue": "2026248",
  "code": "43,26,49,39,14,27,20",
  "zodiac": "鼠,蛇,马,龙,蛇,龙,猪",
  "wave": "green,blue,green,green,blue,green,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026249",
  "ninePool": [
    "蛇",
    "鼠",
    "虎",
    "羊",
    "猴",
    "兔",
    "马",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "虎",
    "羊",
    "猴",
    "兔"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    2,
    5,
    38,
    7,
    41,
    43,
    14,
    17,
    19,
    26,
    29,
    31,
    24,
    36,
    47,
    4
  ],
  "optTails": [
    1,
    6,
    7,
    8,
    2,
    3,
    4
  ],
  "pools": {
    "3": [
      "鼠",
      "蛇",
      "虎"
    ],
    "4": [
      "蛇",
      "鼠",
      "虎",
      "羊"
    ],
    "5": [
      "蛇",
      "鼠",
      "虎",
      "羊",
      "猴"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};