var ensembleData = {
  "time": "2026-09-25 21:32:32",
  "issue": "2026268",
  "code": "48,34,11,21,19,36,40",
  "zodiac": "羊,鸡,猴,狗,鼠,羊,兔",
  "wave": "blue,red,green,green,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026269",
  "ninePool": [
    "鼠",
    "猴",
    "鸡",
    "猪",
    "牛",
    "羊",
    "蛇",
    "虎",
    "龙"
  ],
  "sixPool": [
    "鼠",
    "猴",
    "鸡",
    "猪",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "兔"
  ],
  "numbers": [
    34,
    35,
    7,
    10,
    11,
    43,
    46,
    47,
    19,
    22,
    23,
    31,
    36,
    6,
    42,
    32
  ],
  "optTails": [
    0,
    9,
    2,
    4,
    8,
    3,
    6
  ],
  "pools": {
    "3": [
      "鼠",
      "猴",
      "鸡"
    ],
    "4": [
      "鼠",
      "猴",
      "鸡",
      "猪"
    ],
    "5": [
      "鼠",
      "猴",
      "鸡",
      "猪",
      "牛"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};