var ensembleData = {
  "time": "2026-08-12 21:32:32",
  "issue": "2026224",
  "code": "25,19,08,49,18,36,09",
  "zodiac": "马,鼠,猪,马,牛,羊,狗",
  "wave": "blue,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026225",
  "ninePool": [
    "马",
    "羊",
    "兔",
    "鸡",
    "虎",
    "猪",
    "鼠",
    "牛",
    "狗"
  ],
  "sixPool": [
    "马",
    "羊",
    "兔",
    "虎",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "狗"
  ],
  "numbers": [
    1,
    36,
    37,
    4,
    40,
    12,
    13,
    48,
    16,
    24,
    25,
    28,
    34,
    20,
    44,
    10
  ],
  "optTails": [
    3,
    6,
    7,
    1,
    4,
    9,
    0
  ],
  "pools": {
    "3": [
      "羊",
      "马",
      "兔"
    ],
    "4": [
      "马",
      "羊",
      "兔",
      "虎"
    ],
    "5": [
      "马",
      "羊",
      "兔",
      "虎",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};