var ensembleData = {
  "time": "2026-09-22 21:32:32",
  "issue": "2026265",
  "code": "05,46,40,23,26,44,49",
  "zodiac": "虎,鸡,兔,猴,蛇,猪,马",
  "wave": "green,red,red,red,blue,green,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026266",
  "ninePool": [
    "虎",
    "蛇",
    "猴",
    "狗",
    "鸡",
    "羊",
    "猪",
    "牛",
    "鼠"
  ],
  "sixPool": [
    "虎",
    "蛇",
    "狗",
    "猴",
    "鸡",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "numbers": [
    33,
    2,
    5,
    38,
    41,
    9,
    45,
    14,
    17,
    21,
    26,
    29,
    34,
    36,
    48,
    12
  ],
  "optTails": [
    0,
    9,
    2,
    4,
    6,
    3,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "蛇",
      "狗"
    ],
    "4": [
      "虎",
      "蛇",
      "狗",
      "猴"
    ],
    "5": [
      "虎",
      "蛇",
      "狗",
      "猴",
      "鸡"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};