var ensembleData = {
  "time": "2026-09-08 21:32:32",
  "issue": "2026251",
  "code": "09,06,11,25,08,45,30",
  "zodiac": "狗,牛,猴,马,猪,狗,牛",
  "wave": "blue,green,green,blue,red,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026252",
  "ninePool": [
    "虎",
    "鼠",
    "龙",
    "兔",
    "蛇",
    "猪",
    "猴",
    "羊",
    "马"
  ],
  "sixPool": [
    "虎",
    "鼠",
    "龙",
    "兔",
    "蛇",
    "猪"
  ],
  "killZodiacs": [
    "狗",
    "牛"
  ],
  "numbers": [
    3,
    5,
    7,
    39,
    41,
    43,
    15,
    17,
    19,
    27,
    29,
    31,
    26,
    16,
    28,
    8
  ],
  "optTails": [
    0,
    1,
    3,
    6,
    8,
    5,
    7
  ],
  "pools": {
    "3": [
      "虎",
      "鼠",
      "龙"
    ],
    "4": [
      "虎",
      "鼠",
      "龙",
      "兔"
    ],
    "5": [
      "虎",
      "鼠",
      "龙",
      "兔",
      "蛇"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};