var ensembleData = {
  "time": "2026-09-06 21:32:32",
  "issue": "2026249",
  "code": "41,22,13,36,26,29,23",
  "zodiac": "虎,鸡,马,羊,蛇,虎,猴",
  "wave": "blue,green,red,blue,blue,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026250",
  "ninePool": [
    "猴",
    "蛇",
    "鼠",
    "龙",
    "马",
    "狗",
    "猪",
    "兔",
    "羊"
  ],
  "sixPool": [
    "猴",
    "蛇",
    "龙",
    "狗",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "猴"
  ],
  "numbers": [
    33,
    3,
    35,
    39,
    9,
    11,
    45,
    15,
    47,
    21,
    23,
    27,
    2,
    44,
    14,
    43
  ],
  "optTails": [
    0,
    9,
    3,
    6,
    8,
    2,
    4
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "狗"
    ],
    "4": [
      "猴",
      "蛇",
      "龙",
      "狗"
    ],
    "5": [
      "猴",
      "蛇",
      "龙",
      "狗",
      "猪"
    ]
  },
  "dynamicRate9": 100.0,
  "dynamicRate6": 100.0
};